{
    "intents": [
        {
            "tag": "loneliness",
            "patterns": [
                "I'm experiencing a deep sense of emptiness and longing for human connection.",
                "It's difficult to cope with the feeling of being alone, especially when it seems like everyone else has someone.",
                "I'm struggling to find meaning in my daily life without someone to share it with.",
                "The feeling of isolation is overwhelming and makes it hard to enjoy things that used to bring me joy.",
                "I'm starting to question whether I'm worthy of love and companionship.",
                "The longer I go without meaningful connections, the harder it becomes to reach out and make new ones.",
                "I'm feeling lost and uncertain about how to find the kind of relationships I need.",
                "The more I try to push away the loneliness, the more it seems to consume me.",
                "I'm finding it hard to trust people and let my guard down, which only exacerbates my feelings of loneliness.",
                "I'm struggling to come to terms with the fact that being alone doesn't necessarily mean being unloved.",
                "The weight of my loneliness feels like it's crushing me, and I'm not sure how much longer I can bear it.",
                "I feel like I'm trapped in my own head, with no one to turn to for support or guidance.",
                "It's hard to imagine a future without this pervasive feeling of isolation.",
                "I'm feeling disconnected from my own emotions and struggling to identify what I need to feel more connected to others.",
                "The lack of physical touch and affection is starting to take a toll on my mental health.",
                "I'm feeling stuck and hopeless, like I'm destined to be lonely forever.",
                "I am feeling lonely",
                "I am so lonely",
                "I feel so lonely",
                "I don't have anyone",
                "I feel like no one really understands me, and it's isolating.",
                "I'm missing human connection and feeling like I have no one to talk to.",
                "It's tough to see others enjoying time with friends and family when I feel so alone.",
                "I wish I had someone to share my thoughts and feelings with.",
                "The silence and lack of interaction is starting to feel suffocating.",
                "I'm feeling disconnected from the world around me and unsure of how to change that.",
                "I'm struggling to find a sense of belonging and feel like I don't fit in anywhere.",
                "It's hard to motivate myself to do anything when I feel so lonely.",
                "I'm longing for a sense of community and the support that comes with it.",
                "I'm feeling like I'm stuck in a cycle of loneliness that's hard to break out of.",
                "I feel like nobody cares about me",
                "I feel like I'm on my own",
                "I wish I had someone to share this with",
                "I feel disconnected from everyone",
                "I feel like I don't belong",
                "I'm craving meaningful connections with others, but don't know where to find them.",
                "The lack of social interaction is taking a toll on my mental health.",
                "I feel like I'm the only one going through this, but I know that's not true.",
                "I'm afraid of being vulnerable and opening up to others, but I know it's necessary for building relationships.",
                "It's hard to make friends as an adult and I feel like I've missed my chance.",
                "I'm worried that even if I do make friends, I'll still feel lonely.",
                "I wish I could be more confident and outgoing so that it would be easier to meet new people.",
                "I'm hesitant to reach out to others because I don't want to burden them with my problems.",
                "I'm starting to feel like something is wrong with me because I can't seem to make connections with others.",
                "I'm envious of those who seem to have close friendships and wonder what I'm doing wrong.",
                "I'm realizing that loneliness is not just a temporary feeling, but a long-term struggle that requires attention and effort to overcome.",
                "I'm trying to find activities and groups that align with my interests in hopes of meeting like-minded people.",
                "I know that building relationships takes time and effort, but sometimes it feels like an uphill battle.",
                "I'm learning to be comfortable with being alone, but still crave the connection and companionship of others.",
                "I feel like I've tried everything to meet new people, but nothing seems to work.",
                "The longer I go without meaningful social interaction, the harder it is to reach out to others.",
                "I'm starting to lose hope that I'll ever find someone who truly understands and cares about me.",
                "Sometimes I feel like I'm invisible to the rest of the world.",
                "It's hard to imagine a future where I don't feel so alone.",
                "I wish I had more opportunities to connect with others who share my interests.",
                "I'm worried that if I keep isolating myself, my mental health will suffer even more.",
                "I feel like I'm living in a bubble, watching the world pass me by.",
                "It's hard to make meaningful connections when I'm constantly surrounded by superficial interactions.",
                "I'm starting to question whether I'm capable of forming lasting friendships or relationships.",
                "The more I try to push people away, the more isolated I become.",
                "I feel like my loneliness is a burden that no one wants to deal with.",
                "I'm scared that if I open up to someone, they'll reject me or judge me.",
                "I'm tired of pretending like everything is okay when it's not.",
                "It's difficult to find the motivation to take care of myself when I feel like no one else cares.",
                "I'm afraid that if I reach out for help, I'll be seen as weak or needy.",
                "I feel like I'm missing out on life because I don't have anyone to share it with.",
                "The constant ache of loneliness is exhausting and overwhelming.",
                "I wish I could turn off this feeling of emptiness and longing.",
                "I'm starting to wonder if there's something wrong with me, or if I'm just not meant to be happy.",
                "I'm struggling to find meaning and purpose in my life without the support and connection of others.",
                "I feel like I'm invisible to the world, like no one sees me or cares about me.",
                "I feel like I'm the only one going through this, and it's hard to talk about it with anyone.",
                "I'm afraid that if I do open up to someone, they'll reject me or think I'm too needy.",
                "I wish I had more meaningful connections in my life to balance out the emptiness I feel.",
                "I feel like I have no one to talk to",
                "I feel like I'm drowning in a sea of emptiness.",
                "The loneliness is becoming unbearable.",
                "I feel invisible to the world around me.",
                "The silence is deafening and amplifies my feelings of isolation.",
                "I feel like I'm living life on autopilot, without any real connection or purpose.",
                "The ache in my heart is a constant reminder of how alone I feel.",
                "I'm longing for a sense of intimacy and connection that I just can't seem to find.",
                "I feel like I'm carrying the weight of my loneliness everywhere I go.",
                "I'm struggling to find meaning in my life without someone to share it with.",
                "I feel like I'm trapped in my own mind with no one to turn to for support.",
                "The fear of rejection is keeping me from reaching out and forming new relationships.",
                "I feel like I'm on the outside looking in, watching others connect while I remain alone.",
                "The lack of human connection is making me feel like a shell of a person.",
                "I'm longing for someone who truly understands me and accepts me for who I am.",
                "I feel like I'm running out of energy to keep fighting against the loneliness.",
                "I'm struggling to stay positive and hopeful when it seems like my loneliness will never end.",
                "I feel like I'm in a constant state of sadness and despair because of my loneliness.",
                "I'm craving meaningful conversations with someone who shares my interests and passions.",
                "I feel like my loneliness is a burden that no one wants to bear with me.",
                "The loneliness is suffocating and I'm struggling to catch my breath.",
                "I feel like I'm wandering through life without any real direction or purpose.",
                "The feeling of being disconnected from others is causing me to lose touch with myself.",
                "I feel like I'm stuck in a dark hole with no way out.",
                "I'm feeling lost and uncertain about how to find the kind of relationships I need.",
                "I feel like I'm constantly reaching out for connection, but no one is reaching back.",
                "The loneliness is making me question my worth and value as a person.",
                "I'm feeling empty and hollow inside without someone to share my life with.",
                "It's hard to put into words just how much the loneliness is weighing on me.",
                "I'm longing for a deep connection with someone who truly understands me.",
                "The longer I go without social interaction, the more difficult it becomes to reach out and make new connections.",
                "It's tough to admit that I'm feeling lonely because I worry that it makes me seem needy or weak.",
                "I'm struggling to come to terms with the fact that I can be surrounded by people and still feel incredibly alone.",
                "I'm feeling like I'm constantly on the outside looking in, unable to fully participate in the world around me.",
                "The lack of physical touch and affection is making me feel starved for human connection.",
                "I'm feeling like I'm in a rut, with no meaningful connections to help pull me out.",
                "The isolation is causing me to feel anxious and depressed, and it's becoming harder to hide it from others.",
                "I'm realizing that I've been neglecting my social needs and focusing too much on work and other obligations.",
                "It's hard to shake the feeling that there's something inherently wrong with me that's preventing me from making meaningful connections.",
                "I'm feeling like I'm the only one who's struggling with loneliness, which only makes me feel more isolated.",
                "I'm finding myself longing for the companionship of a pet because I crave that connection so much.",
                "The silence in my home is becoming unbearable, and I'm starting to feel like I'm going crazy.",
                "I'm struggling to motivate myself to do anything because everything feels pointless without someone to share it with.",
                "I'm feeling like I'm stuck in a vicious cycle of loneliness and depression that's hard to break out of.",
                "The idea of reaching out to others for help feels overwhelming and scary, but I know I need to do it.",
                "I'm feeling like I've lost a part of myself without someone to confide in and share my experiences with.",
                "The thought of going through life alone is becoming increasingly difficult to bear.",
                "I'm feeling like I'm missing out on a key part of the human experience by not having meaningful relationships.",
                "The loneliness is making me question my self-worth and whether I'm deserving of love and connection.",
                "I'm struggling to find ways to fill the void left by the lack of social interaction in my life.",
                "I'm feeling like I'm in a constant state of longing, unable to find satisfaction or contentment in anything.",
                "The loneliness is starting to seep into other areas of my life, making it hard to concentrate at work or enjoy my hobbies.",
                "I'm realizing that I've been neglecting my own needs for social interaction and that it's time to make a change.",
                "The feeling of being disconnected from others is causing me to question my place in the world.",
                "I'm struggling to find the words to describe just how lonely I'm feeling.",
                "The thought of opening up to others about my loneliness feels terrifying, but I know it's necessary if I want to feel better.",
                "I'm feeling like I'm living a half-life without the connections that give meaning to it.",
                "The loneliness is making me feel like I'm constantly walking through a fog, unable to see what's in front of me.",
                "The feeling of loneliness is like a constant ache in my chest that just won't go away.",
                "I'm feeling lost and adrift, with no one to anchor me.",
                "It's hard to feel like I'm truly living when I'm so disconnected from others.",
                "I'm craving intimacy and connection on a level that feels almost primal.",
                "It's tough to watch as others build meaningful relationships while I'm stuck on the sidelines.",
                "I'm starting to feel like I'm invisible to others, like I don't even exist.",
                "The longer I go without social interaction, the harder it becomes to reach out and make new connections.",
                "I'm feeling like I'm missing out on life by not having close relationships with others.",
                "The feeling of loneliness is so overwhelming that it's hard to focus on anything else.",
                "I'm starting to forget what it feels like to be truly happy and fulfilled.",
                "It's hard to stay positive and hopeful when I'm constantly battling feelings of loneliness.",
                "I'm finding it hard to connect with others even when I do have the opportunity to do so.",
                "The lack of emotional support is taking a toll on my mental health.",
                "I'm feeling like I'm trapped in my own mind with no way out.",
                "It's tough to navigate life without a support system to lean on.",
                "I'm longing for someone to share my dreams and aspirations with.",
                "The feeling of being alone in a crowded room is almost worse than being physically alone.",
                "I'm feeling like I'm not worthy of love or connection, and it's hard to shake that feeling.",
                "The longer I go without meaningful connection, the more anxious and depressed I become.",
                "I'm struggling to find a way to reach out to others and build relationships.",
                "It's tough to trust others when I've been hurt so many times before.",
                "I'm starting to feel like I'm not capable of forming meaningful relationships with others.",
                "The silence and emptiness of my surroundings are almost deafening.",
                "I'm feeling like I'm stuck in a cycle of despair that's hard to break free from.",
                "I'm missing out on the joy that comes from shared experiences and memories with others.",
                "It's tough to find motivation to take care of myself when I feel like no one else cares.",
                "I'm feeling like I'm living in a different world than everyone else.",
                "The feeling of being disconnected from others is almost like a physical ache.",
                "I'm starting to question whether I'm meant to be alone forever.",
                "It's tough to stay optimistic about the future when I'm struggling so much in the present.",
                "I'm feeling like I'm stuck in a rut with no way out.",
                "The lack of human connection is starting to affect every aspect of my life.",
                "I'm starting to feel like my loneliness is a reflection of my own flaws and shortcomings.",
                "It's tough to see others forming close bonds when I'm struggling to even make acquaintances.",
                "I'm feeling like I'm not living up to my full potential without meaningful relationships in my life.",
                "The feeling of loneliness is almost like a heavy weight that I'm constantly carrying around.",
                "I'm starting to feel like I'm not meant to be happy.",
                "It's tough to imagine a future without the pervasive feeling of loneliness.",
                "I'm feeling like I'm always on the outside looking in.",
                "I feel like I'm trapped in a never-ending cycle of loneliness and despair.",
                "The feeling of emptiness inside me is so overwhelming that I can't ignore it anymore.",
                "I'm yearning for someone to share my life with, but it feels like everyone around me is already taken.",
                "It's hard to stay positive when every day feels like a battle against loneliness.",
                "I'm starting to doubt if I'll ever find someone who truly understands me.",
                "The more I try to connect with others, the more I feel like an outsider.",
                "I'm struggling to come to terms with the fact that I'm feeling lonely even when surrounded by people.",
                "I'm feeling like I'm not enough, like there's something inherently wrong with me that repels people.",
                "It's hard to watch others enjoying social interactions and feeling left out.",
                "I'm tired of putting on a brave face and pretending that everything is okay.",
                "I feel like I'm carrying the weight of my loneliness around with me everywhere I go.",
                "I'm starting to feel like my loneliness is a permanent part of my identity.",
                "I'm struggling to find the courage to reach out to others for fear of rejection.",
                "I'm feeling like I'm not worthy of love and that no one will ever truly care about me.",
                "The silence in my life is deafening and suffocating.",
                "I'm feeling like I'm stuck in a never-ending rut of loneliness with no way out.",
                "I'm yearning for a sense of belonging and the feeling of being a part of something bigger than myself.",
                "I'm feeling like I'm the only person in the world who's experiencing this kind of loneliness.",
                "It's hard to keep going when I feel like I'm all alone in this world.",
                "I'm struggling to find the motivation to do anything when I feel so lonely.",
                "I feel like I'm always the one reaching out to others, but no one ever reaches out to me.",
                "I'm starting to believe that loneliness is my fate and that I'll never find true companionship.",
                "I'm feeling like my loneliness is a result of my own inadequacies and flaws.",
                "It's hard to see a way out of this darkness when I feel so disconnected from everything and everyone.",
                "I'm feeling like I'm always the odd one out, like I don't quite fit in anywhere.",
                "I'm struggling to find the words to express how lonely I'm feeling.",
                "I'm feeling like I'm invisible to the world around me, like no one notices or cares about my existence.",
                "It's hard to stay hopeful when every attempt to connect with others seems to end in disappointment.",
                "I'm starting to wonder if there's something wrong with me that makes me repulsive to others.",
                "I'm feeling like I'm not living my life to the fullest because I don't have anyone to share it with.",
                "I'm struggling to find the courage to put myself out there and meet new people.",
                "I'm feeling like I'm constantly searching for something that I'll never find.",
                "It's hard to ignore the ache in my heart that comes from feeling so alone.",
                "I'm starting to feel like I'm going crazy because of the constant loneliness.",
                "I'm feeling like I'm stuck in a never-ending maze of loneliness with no way out."
            ],
            "responses": [
                "The Lonely City: Adventures in the Art of Being Alone by Olivia Laing",
                "The Anatomy of Loneliness: How to Find Your Way Back to Connection by Teal Swan",
                "Lost Connections: Uncovering the Real Causes of Depression – and the Unexpected Solutions by Johann Hari",
                "The Noonday Demon: An Atlas of Depression by Andrew Solomon",
                "The Power of Now: A Guide to Spiritual Enlightenment by Eckhart Tolle",
                "Man's Search for Meaning by Viktor E. Frankl",
                "The Art of Asking: How I Learned to Stop Worrying and Let People Help by Amanda Palmer",
                "The Alchemist by Paulo Coelho",
                "Quiet: The Power of Introverts in a World That Can't Stop Talking by Susan Cain"
            ]
        },
        {
            "tag": "Overwhelm",
            "patterns": [
                "I'm feeling overwhelmed and just need some space.",
                "I'm feeling lost and don't know what to do.",
                "I feel like I have too much on my plate and don't know where to start.",
                "Everything is just too much right now, and I can't seem to keep up.",
                "I'm struggling to balance all of my responsibilities and feeling like I'm falling short.",
                "The stress is just too much to handle, and I'm not sure how much more I can take.",
                "I'm feeling paralyzed by my to-do list and don't even know where to begin.",
                "It seems like everything is going wrong, and I can't catch a break.",
                "I feel like I'm drowning in my own thoughts and emotions.",
                "I'm so tired and burned out that I can't seem to find any motivation.",
                "I'm feeling stuck and like there's no way out of this situation.",
                "I'm completely overwhelmed by the challenges in my life right now.",
                "I'm feeling hopeless and can't seem to see the light at the end of the tunnel.",
                "I can't handle this right now",
                "I feel like everything is happening at once",
                "I'm at my breaking point",
                "I feel like I can't catch a break",
                "I feel like I'm in a constant state of chaos",
                "I don't know how to handle all of this",
                "I'm struggling to prioritize my tasks and feeling like everything is urgent.",
                "I'm feeling suffocated by the weight of my responsibilities.",
                "It feels like I'm drowning and can't come up for air.",
                "I'm feeling like I'm on an emotional rollercoaster that I can't get off.",
                "I'm at a loss for how to manage everything on my plate.",
                "I'm feeling like I'm constantly treading water and can't get ahead.",
                "I'm having trouble sleeping because my mind won't stop racing.",
                "I'm feeling like I'm stretched too thin and can't possibly do it all.",
                "I'm struggling to find a sense of balance in my life.",
                "I feel like I'm carrying the weight of the world on my shoulders.",
                "I'm feeling like I'm stuck in a never-ending cycle of stress and overwhelm.",
                "I'm finding it hard to focus on anything because my mind is so cluttered.",
                "I'm feeling like I'm in a constant state of crisis management.",
                "I'm feeling like I'm constantly behind and can't catch up.",
                "I'm struggling to find any joy in my life because everything feels like a chore.",
                "I'm feeling like I'm in a fog and can't see a way out.",
                "I'm feeling like I'm drowning in a sea of tasks and responsibilities.",
                "I'm feeling like I'm carrying a heavy burden that I can't put down.",
                "I'm struggling to keep up with the demands of my job and personal life.",
                "I'm feeling like I'm being pulled in too many different directions at once.",
                "I'm feeling like I'm losing my grip on things.",
                "I'm feeling like I'm on the verge of a breakdown.",
                "I'm feeling like I'm stuck in quicksand and can't move forward.",
                "I'm feeling like I'm constantly fighting an uphill battle.",
                "I'm feeling like I'm in a race that I can't possibly win.",
                "I'm feeling like I'm trapped in a cycle of stress and anxiety.",
                "I'm feeling like I'm in over my head and can't keep up.",
                "I'm feeling like I'm carrying too much weight and it's starting to crush me.",
                "I'm feeling like I'm running on empty and don't have anything left to give.",
                "I'm feeling like I'm barely holding it together.",
                "I'm feeling like I'm drowning in a sea of expectations.",
                "I'm feeling like I'm constantly on edge and can't relax.",
                "I'm feeling like I'm stuck in a rut and can't break free.",
                "I'm feeling like I'm at the mercy of my own thoughts and emotions.",
                "I'm feeling like I'm juggling too many balls and they're all about to drop.",
                "I'm feeling like I'm stuck in a maze and can't find my way out.",
                "I'm feeling like I'm caught in a vicious cycle of stress and exhaustion.",
                "I'm feeling like I'm constantly putting out fires and can't get ahead.",
                "I'm feeling like I'm suffocating under the weight of my own expectations.",
                "I'm feeling like I'm stuck in a downward spiral and can't pull myself out.",
                "I'm feeling like my life is spiraling out of control and I can't seem to get a handle on things.",
                "It's like the weight of the world is on my shoulders and I'm struggling to keep it together.",
                "I feel like I'm suffocating under the pressure of everything I need to do.",
                "I'm so busy that I don't even have time to think about what I need to do next.",
                "I feel like I'm constantly juggling too many balls, and I'm afraid I'm going to drop them all.",
                "I'm feeling like I'm stuck in a rut, and I don't know how to get out of it.",
                "I'm overwhelmed to the point where I'm feeling physical symptoms like headaches and stomach pains.",
                "I'm worried that if I take a break, everything will fall apart.",
                "I feel like I'm running on fumes, and I don't know how much longer I can keep going.",
                "I'm struggling to prioritize and figure out what's most important.",
                "I'm feeling like I'm on a never-ending hamster wheel, and I can't seem to get off.",
                "I'm feeling like I'm drowning in a sea of tasks and responsibilities.",
                "I'm feeling like I'm constantly playing catch-up and can never get ahead.",
                "I'm struggling to focus and be productive because my mind is constantly racing.",
                "I'm feeling like I'm stuck in a fog and can't see a way out.",
                "I feel like I'm constantly on the brink of a breakdown, and I don't know how to avoid it.",
                "I'm feeling like I'm being pulled in a million different directions, and I can't keep up.",
                "I'm struggling to find balance in my life and feeling like I'm always sacrificing something.",
                "I'm feeling like I'm in a constant state of overwhelm, and it's affecting my mental health.",
                "I'm feeling like I'm failing at everything because I can't seem to get anything done.",
                "I'm feeling like I'm trapped in a cycle of stress and anxiety.",
                "I'm feeling like I'm in over my head, and I don't know how to ask for help.",
                "I'm struggling to manage my time effectively and feeling like I'm always behind.",
                "I'm feeling like I'm stuck in a never-ending cycle of responsibilities and obligations.",
                "I'm feeling like I'm always putting out fires and never able to focus on what's important.",
                "I'm struggling to cope with the demands of my job and personal life.",
                "I'm feeling like I'm constantly on edge, waiting for the next thing to go wrong.",
                "I'm feeling like I'm drowning in a sea of information and can't seem to make sense of it all.",
                "I'm feeling like I'm losing control of my life and can't seem to get it back.",
                "I'm feeling like I'm constantly treading water and never able to make progress.",
                "I'm feeling like I'm suffocating under the weight of my own expectations.",
                "I'm struggling to find a way to take care of myself amidst all of my responsibilities.",
                "I'm feeling like I'm constantly under attack and can't seem to find a moment of peace.",
                "I'm feeling like I'm constantly letting people down because I can't keep up with everything.",
                "I feel like I'm suffocating under the weight of my responsibilities.",
                "I'm feeling completely drained and don't know how to recharge.",
                "I'm struggling to find a sense of purpose or direction in my life.",
                "The pressure is too much, and I feel like I'm going to crack.",
                "I'm feeling completely isolated and alone in my struggles.",
                "I'm constantly second-guessing myself and my decisions.",
                "I'm having trouble sleeping and my anxiety is through the roof.",
                "I feel like I'm failing at everything and can't seem to make any progress.",
                "I'm feeling stuck in a rut and don't know how to get out.",
                "I'm overwhelmed by the sheer amount of information and options available to me.",
                "I'm struggling to juggle multiple roles and responsibilities, and it's taking a toll on me.",
                "I'm feeling like I'm in a constant state of crisis and can't seem to catch a break.",
                "I'm finding it difficult to prioritize my tasks and make progress.",
                "I'm feeling like I'm drowning in my own thoughts and emotions, and I don't know how to swim to the surface.",
                "I'm having trouble finding the motivation to even get out of bed in the morning.",
                "I'm feeling like I'm stuck in a never-ending cycle of stress and burnout.",
                "I'm overwhelmed by the demands of others and struggling to establish boundaries.",
                "I'm feeling like I'm not living up to my own expectations and it's causing me a great deal of distress.",
                "I'm struggling to find meaning or purpose in my daily tasks and responsibilities.",
                "I'm feeling like my life is completely out of my control and I don't know how to regain it.",
                "I'm feeling like I'm constantly behind and can't seem to catch up no matter how hard I try.",
                "I'm feeling like I'm on a roller coaster ride of emotions and can't seem to get off.",
                "I'm feeling like I'm in a maze and can't seem to find my way out.",
                "I'm overwhelmed by the uncertainty and instability in my life.",
                "I'm feeling like I'm constantly fighting against myself and my own limitations.",
                "I'm struggling to find balance in my life and prioritize my own needs.",
                "I'm feeling like I'm stuck in a cycle of negative thinking and can't seem to break free.",
                "I'm feeling like I'm carrying the weight of the world on my shoulders.",
                "I'm struggling to make decisions and feeling paralyzed by indecision.",
                "I'm feeling like I'm stuck in a never-ending cycle of setbacks and disappointments.",
                "I'm feeling like I'm running on empty and don't know how to refuel.",
                "I'm feeling like I'm constantly trying to keep up with everyone else and falling short.",
                "I'm struggling to manage my time effectively and feeling like I'm always running behind.",
                "I'm feeling like my life is completely out of balance, and I don't know how to regain equilibrium.",
                "I'm feeling like I'm trapped in a negative feedback loop and can't seem to escape.",
                "I'm struggling to find a way to cope with the stress and anxiety in my life.",
                "I'm feeling like I'm losing control of my life and don't know how to regain it.",
                "I'm struggling to manage my time and prioritize my tasks.",
                "I feel like I'm constantly playing catch-up and can never get ahead.",
                "I'm finding it hard to focus on anything because I'm so overwhelmed.",
                "I feel like I'm carrying the weight of the world on my shoulders.",
                "I'm having trouble sleeping because my mind won't shut off.",
                "I'm constantly worrying about the future and what it holds.",
                "I'm afraid to ask for help because I don't want to burden anyone else.",
                "I feel like I'm in a never-ending cycle of stress and anxiety.",
                "I'm having trouble making decisions because my mind feels foggy.",
                "I'm feeling like I'm failing at everything and can't seem to get anything right.",
                "I'm experiencing physical symptoms like headaches and stomach aches due to stress.",
                "I'm having trouble connecting with others because I'm so preoccupied with my own problems.",
                "I'm feeling guilty for not being able to handle everything on my own.",
                "I'm losing my motivation to do anything because everything feels too hard.",
                "I feel like I'm running on empty and don't know how to recharge.",
                "I'm feeling like I'm in a constant state of crisis management.",
                "I'm feeling like my life is out of control and I don't know how to regain balance.",
                "I'm feeling like I'm letting down everyone around me.",
                "I'm feeling like I'm stuck in a rut and can't break free.",
                "I'm feeling like I'm carrying a heavy emotional burden and don't know how to release it.",
                "I'm feeling like my problems are never-ending and there's no end in sight.",
                "I'm feeling like I'm losing my sense of self and don't know who I am anymore.",
                "I'm feeling like I'm constantly on edge and can't relax.",
                "I'm feeling like I'm not living up to my own expectations.",
                "I'm feeling like I'm drowning in a sea of responsibilities and can't seem to stay afloat.",
                "I'm feeling like I'm not making any progress, no matter how hard I try.",
                "I'm feeling like I'm stuck in a negative thought pattern that I can't break out of.",
                "I'm feeling like I'm constantly battling my own mind and can't seem to find peace.",
                "I'm feeling like I'm on a never-ending treadmill and can't seem to get off.",
                "I'm feeling like I'm suffocating under the weight of my own expectations.",
                "I feel like I'm suffocating under the weight of my responsibilities.",
                "It's like I'm constantly running on a hamster wheel and can't get off.",
                "I feel like I'm carrying the weight of the world on my shoulders.",
                "I can't seem to focus on anything because my mind is always racing.",
                "I'm exhausted from trying to keep up with everything and everyone.",
                "I feel like I'm drowning in my own insecurities and doubts.",
                "I'm afraid that if I take a break, everything will fall apart.",
                "I feel like I'm always letting someone down no matter how hard I try.",
                "I'm so anxious that I can't even make a simple decision.",
                "I'm constantly worried that I'm not doing enough.",
                "I feel like I'm on the verge of a breakdown.",
                "I'm overwhelmed by the sheer number of things I need to get done.",
                "I feel like I'm stuck in a never-ending cycle of stress and anxiety.",
                "I'm constantly second-guessing myself and my decisions.",
                "I'm afraid to ask for help because I don't want to appear weak.",
                "I feel like I'm always playing catch-up and can't get ahead.",
                "I'm overwhelmed by the pressure to be perfect.",
                "I feel like I'm always behind and can't catch up no matter how hard I try.",
                "I'm so exhausted that I can't even imagine doing anything else.",
                "I'm constantly worried about what other people think of me.",
                "I'm paralyzed by the fear of failure.",
                "I'm struggling to keep my head above water.",
                "I feel like I'm in over my head and can't handle it.",
                "I'm so stressed out that I can't even enjoy the things I used to love.",
                "I feel like I'm running on fumes and can't keep going much longer.",
                "I'm struggling to find a way to prioritize everything.",
                "I'm overwhelmed by the feeling that I'm not doing anything right.",
                "I'm so busy that I don't have time to take care of myself.",
                "I feel like I'm losing control of my life.",
                "I'm struggling to find a way to balance my personal and professional life."
            ],
            "responses": [
                "The Power of Now: A Guide to Spiritual Enlightenment by Eckhart Tolle",
                "The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change by Stephen R. Covey",
                "Essentialism: The Disciplined Pursuit of Less by Greg McKeown",
                "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones by James Clear",
                "Getting Things Done: The Art of Stress-Free Productivity by David Allen",
                "The One Thing: The Surprisingly Simple Truth Behind Extraordinary Results by Gary Keller and Jay Papasan",
                "The Joy of Missing Out: Live More by Doing Less by Tonya Dalton",
                "The 4-Hour Work Week: Escape the 9-5, Live Anywhere and Join the New Rich by Timothy Ferriss",
                "Do Less: A Revolutionary Approach to Time and Energy Management for Busy Moms by Kate Northrup",
                "The Upside of Stress: Why Stress Is Good for You, and How to Get Good at It by Kelly McGonigal"
            ]
        },
        {
            "tag": "General sadness",
            "patterns": [
                "I feel down",
                "I feel sad",
                "I'm finding it hard to find joy in the things that used to make me happy.",
                "I'm struggling to get out of bed and face the day.",
                "I feel like I'm carrying a heavy weight around with me all the time.",
                "I'm experiencing a deep sense of sadness that I can't seem to shake off.",
                "I feel like I'm stuck in a dark place with no way out.",
                "I'm feeling numb and disconnected from my emotions.",
                "I'm finding it difficult to focus on anything because my mind is clouded with sadness.",
                "I'm struggling to find the energy to do anything because of how down I feel.",
                "I feel like I'm stuck in a rut and can't seem to get out of it.",
                "I'm feeling a deep sense of loss and sadness that's hard to put into words.",
                "I am sad",
                "I feel empty",
                "I'm really down right now",
                "I'm feeling blue",
                "I'm feeling a bit emotional",
                "I'm having a tough time right now",
                "I'm feeling overwhelmed by sadness",
                "I'm struggling to keep it together",
                "I feel like I'm in a constant state of sorrow.",
                "It's like there's a cloud hanging over me all the time.",
                "I'm feeling a sense of hopelessness and despair.",
                "I can't seem to find any joy or happiness in anything I do.",
                "It feels like I'm carrying a heavy burden that I can't put down.",
                "My heart feels heavy with sadness and it's hard to shake off.",
                "I feel like I'm drowning in sadness and can't seem to catch my breath.",
                "The world feels dark and bleak right now.",
                "I'm struggling to find a reason to keep going.",
                "I feel like I'm on an emotional rollercoaster and can't get off.",
                "I'm finding it hard to see any light at the end of the tunnel.",
                "It's like my emotions have been turned down and I can't feel anything.",
                "I feel like I'm stuck in a never-ending cycle of sadness.",
                "I'm constantly feeling drained and exhausted.",
                "I'm struggling to cope with the overwhelming sadness I'm feeling.",
                "It feels like I'm trapped in a dark hole with no way out.",
                "I feel like I'm losing control over my emotions.",
                "I'm finding it difficult to connect with others because of my sadness.",
                "I'm feeling isolated and alone in my sadness.",
                "I feel like I'm carrying the weight of the world on my shoulders.",
                "I'm struggling to find a way to express the depth of my sadness.",
                "It's like I'm walking through life with a heavy heart.",
                "I'm finding it hard to imagine a future where I'm not feeling this way.",
                "I feel like I'm drowning in a sea of sadness and can't find my way back to shore.",
                "I'm experiencing a deep sense of grief and loss that's hard to process.",
                "It feels like I'm stuck in a never-ending cycle of sadness and despair.",
                "I'm struggling to find any motivation to do the things I used to enjoy.",
                "I feel like I'm living in a world without color or joy.",
                "I'm finding it hard to remember a time when I wasn't feeling this way.",
                "It's like my heart has been shattered into a million pieces and I can't seem to put it back together.",
                "It's okay to not be okay. Your emotions are valid and important.",
                "Sometimes, sadness is a necessary part of healing and growth.",
                "Remember that you don't have to go through this alone. Reach out to someone for support.",
                "It's important to take care of yourself during times of sadness. Make sure to prioritize self-care.",
                "It's okay to take a break and give yourself permission to rest and recharge.",
                "Journaling or talking to a therapist can be helpful in processing and working through your emotions.",
                "Remember that sadness is a temporary feeling and it will pass with time.",
                "Try to focus on small moments of joy and gratitude, even amidst the sadness.",
                "Be kind and gentle with yourself during this time.",
                "Remember that it's okay to ask for help when you need it.",
                "It's important to address the root of your sadness and take steps towards healing and growth.",
                "Remember that sadness is a natural part of the human experience and you're not alone in feeling this way.",
                "Try to focus on the present moment and practice mindfulness to ease feelings of sadness.",
                "Don't be afraid to seek professional help if your sadness is impacting your daily life.",
                "Surround yourself with people who support and uplift you during this time.",
                "Remember that it's okay to feel a range of emotions, including sadness.",
                "Try to find ways to express your emotions through creative outlets like art or music.",
                "Focus on small, achievable goals to give yourself a sense of accomplishment and boost your mood.",
                "Remember that healing is not linear and there may be setbacks along the way.",
                "Practice self-compassion and avoid self-criticism during this time.",
                "Remember that there is no timeline for healing and it's important to allow yourself time and space to process your emotions.",
                "Engage in activities that bring you joy or a sense of purpose.",
                "Remember that you are not defined by your sadness and it does not make you weak.",
                "Try to identify any negative thought patterns and work on replacing them with more positive and empowering ones.",
                "Remember that you are deserving of love and support, even during times of sadness.",
                "Try to maintain a routine and structure in your daily life to give yourself a sense of stability.",
                "Remember that your emotions are valid, even if you can't always explain or understand them.",
                "Take care of your physical health through exercise, healthy eating, and getting enough sleep.",
                "Remember that there is always hope for healing and growth, even during times of deep sadness.",
                "Try to be patient and compassionate with yourself as you work through your emotions.",
                "It's okay to not be okay.",
                "Sadness is a natural part of life, and it's important to allow yourself to feel it.",
                "Remember that you are not alone, and there is support available.",
                "It's important to take care of yourself during this time, even if it feels difficult.",
                "Sometimes it's helpful to talk to a therapist or counselor to work through your feelings.",
                "It's okay to take a break and allow yourself to rest and recharge.",
                "Remember that this feeling won't last forever, and there is hope for the future.",
                "It's important to practice self-compassion and be kind to yourself during this time.",
                "It's okay to ask for help and support from others.",
                "Try to focus on the present moment and find joy in small things, even if it's just for a moment.",
                "Remember that your feelings are valid, and it's okay to express them.",
                "Be patient with yourself as you work through this difficult time.",
                "Try to find healthy ways to cope with your emotions, such as exercise or meditation.",
                "Journaling can be a helpful way to process your thoughts and feelings.",
                "Remember that you are strong and capable of getting through this.",
                "Allow yourself to grieve and process your emotions at your own pace.",
                "Try to find a support group or community of people who can relate to what you're going through.",
                "It's important to address any underlying issues that may be contributing to your sadness.",
                "Remember that seeking help is a sign of strength, not weakness.",
                "Try to identify things that bring you comfort and make time for them in your day.",
                "It's important to set realistic expectations for yourself during this time.",
                "Remember that it's okay to take things one day at a time.",
                "Try to find meaning and purpose in your life, even during difficult times.",
                "It's important to stay connected with loved ones and reach out for support when needed.",
                "Remember that you have the power to create positive changes in your life.",
                "Try to find ways to express your creativity and engage in activities that bring you joy.",
                "It's important to be gentle with yourself and practice self-care.",
                "Remember that healing is a process, and it's okay to take things at your own pace.",
                "Try to find ways to give back to others and help those in need.",
                "It's important to celebrate even small victories and moments of progress.",
                "I feel like my emotions are controlling me and I can't seem to shake it off.",
                "I'm finding it hard to see the good in anything right now.",
                "I feel like I'm in a constant state of sadness and can't escape it.",
                "I'm struggling to connect with others because of how sad I feel.",
                "I'm experiencing a deep sense of grief that's hard to explain.",
                "I feel like I'm on an emotional rollercoaster and can't get off.",
                "I'm having trouble sleeping because of how sad I feel.",
                "I'm feeling hopeless and don't see a way out of this sadness.",
                "I feel like I'm lost and don't know how to find my way back to happiness.",
                "I'm feeling isolated and alone in my sadness.",
                "I'm finding it hard to enjoy the things I used to love because of how sad I feel.",
                "I feel like my sadness is consuming me.",
                "I'm struggling to find motivation to do anything because of how down I feel.",
                "I'm feeling like a burden to others because of my sadness.",
                "I'm feeling like I'm stuck in a dark hole and can't find a way out.",
                "I feel like I'm carrying a heavy weight on my shoulders all the time.",
                "I'm feeling lost and uncertain about my future.",
                "I'm feeling like I've lost my sense of purpose and direction in life.",
                "I feel like I'm drowning in my sadness.",
                "I'm finding it hard to be kind to myself because of how sad I feel.",
                "I'm struggling to cope with the overwhelming sadness I'm feeling.",
                "I feel like I'm just going through the motions and not really living.",
                "I'm feeling like I'm stuck in a never-ending cycle of sadness.",
                "I'm feeling like my life is meaningless because of how sad I feel.",
                "I'm struggling to find hope for the future.",
                "I feel like I'm in a deep pit of despair.",
                "I'm finding it hard to express my sadness to others.",
                "I'm feeling like I'm in a constant state of mourning.",
                "I feel like I'm broken and can't be fixed.",
                "I'm feeling like my sadness is a heavy burden that I can't escape from.",
                "I feel like I'm stuck in a never-ending cycle of sadness and despair.",
                "I'm finding it hard to see the positives in my life right now.",
                "I'm experiencing a deep sense of grief and loss that's consuming me.",
                "It feels like the weight of the world is on my shoulders and I can't shake it off.",
                "I'm feeling like everything in my life is just one big disappointment.",
                "I'm struggling to find a reason to keep going and it's scary.",
                "It's like I'm in a dark tunnel and I can't see the light at the end of it.",
                "I feel like I'm just going through the motions of life without any real purpose or meaning.",
                "I'm constantly feeling exhausted and drained from the sadness.",
                "It's hard to explain how I feel, but it's like a deep ache in my heart.",
                "I feel like I'm suffocating under the weight of my own sadness.",
                "I'm finding it difficult to connect with others because I'm so consumed by my sadness.",
                "I feel like I'm trapped in my own mind and can't escape the sadness.",
                "I'm struggling to find hope for the future.",
                "The sadness is so overwhelming that it's hard to function in my daily life.",
                "I feel like I'm just existing rather than living.",
                "I'm constantly battling negative thoughts and feelings.",
                "It's like a cloud of sadness is following me everywhere I go.",
                "I'm feeling lost and unsure of where to turn for help.",
                "I'm feeling like I'm alone in my sadness and that no one understands.",
                "I'm struggling to find any enjoyment in the things I used to love.",
                "The sadness is so intense that it physically hurts.",
                "I'm feeling like I'm in a never-ending storm of emotions.",
                "I'm finding it hard to see a way out of this sadness.",
                "The sadness is affecting every aspect of my life.",
                "I feel like I'm constantly on the verge of tears.",
                "I'm feeling like I've lost my sense of purpose and direction.",
                "I'm struggling to find the motivation to do anything.",
                "I feel like I'm drowning in my own sadness.",
                "I feel like I'm stuck in a never-ending cycle of sadness and despair.",
                "I'm finding it hard to see the positives in my life right now.",
                "I'm experiencing a deep sense of grief and loss that's consuming me.",
                "It feels like the weight of the world is on my shoulders and I can't shake it off.",
                "I'm feeling like everything in my life is just one big disappointment.",
                "I'm struggling to find a reason to keep going and it's scary.",
                "It's like I'm in a dark tunnel and I can't see the light at the end of it.",
                "I feel like I'm just going through the motions of life without any real purpose or meaning.",
                "I'm constantly feeling exhausted and drained from the sadness.",
                "It's hard to explain how I feel, but it's like a deep ache in my heart.",
                "I feel like I'm suffocating under the weight of my own sadness.",
                "I'm finding it difficult to connect with others because I'm so consumed by my sadness.",
                "I feel like I'm trapped in my own mind and can't escape the sadness.",
                "I'm struggling to find hope for the future.",
                "The sadness is so overwhelming that it's hard to function in my daily life.",
                "I feel like I'm just existing rather than living.",
                "I'm constantly battling negative thoughts and feelings.",
                "It's like a cloud of sadness is following me everywhere I go.",
                "I'm feeling lost and unsure of where to turn for help.",
                "I'm feeling like I'm alone in my sadness and that no one understands.",
                "I'm struggling to find any enjoyment in the things I used to love.",
                "The sadness is so intense that it physically hurts.",
                "I'm feeling like I'm in a never-ending storm of emotions.",
                "I'm finding it hard to see a way out of this sadness.",
                "The sadness is affecting every aspect of my life.",
                "I feel like I'm constantly on the verge of tears.",
                "I'm feeling like I've lost my sense of purpose and direction.",
                "I'm struggling to find the motivation to do anything.",
                "I feel like I'm drowning in my own sadness.",
                "I'm feeling like I'm just going through the motions of life without any real joy or happiness.",
                "It feels like a weight on my chest that I can't shake off.",
                "I'm experiencing a sense of hopelessness and despair.",
                "Everything just feels so difficult and exhausting right now.",
                "I feel like I'm in a constant state of sadness, even when things are going well.",
                "I'm struggling to find any enjoyment in things I used to love.",
                "It's like I'm stuck in a cycle of negative thoughts and emotions that I can't break free from.",
                "I feel like I'm just going through the motions and not really living.",
                "I feel like I'm watching life pass me by and I can't do anything to stop it.",
                "It's hard to explain, but I just feel this overwhelming sadness all the time.",
                "I feel like I'm lost in a sea of sadness and I don't know how to swim back to shore.",
                "I'm finding it hard to see any light at the end of the tunnel right now.",
                "I feel like I'm living in a fog of sadness and I can't see my way out of it.",
                "I'm struggling to connect with others because of how down I feel.",
                "I feel like I'm carrying a heavy burden that no one else can see.",
                "It's like I'm trapped in a dark room with no way out.",
                "I feel like I'm drowning in my own sadness.",
                "I'm finding it hard to believe that things will ever get better.",
                "I feel like I'm living in a world of gray and there's no color left.",
                "I feel like I'm walking through life with a heavy heart.",
                "It's like I'm constantly fighting against a wave of sadness that keeps crashing over me.",
                "I'm struggling to find a reason to get out of bed in the morning.",
                "I feel like I'm in a deep hole and I can't climb my way out of it.",
                "I feel like I'm just going through the motions and not really living.",
                "I feel like I'm on an emotional rollercoaster and I can't get off.",
                "It's like I'm living in a world where everything is tinged with sadness.",
                "I'm finding it hard to see any hope for the future right now.",
                "I feel like I'm living in a constant state of grief.",
                "It's like I'm carrying a heavy weight around with me all the time.",
                "I feel like I'm stuck in a dark place with no way out.",
                "I'm experiencing a deep sense of loss and sadness that's hard to put into words.",
                "I'm feeling like I'm just going through the motions of life without any real joy or happiness."
            ],
            "responses": [
                "The Noonday Demon: An Atlas of Depression by Andrew Solomon",
                "Feeling Good: The New Mood Therapy by David D. Burns",
                "The Year of Magical Thinking by Joan Didion",
                "The Happiness Trap: How to Stop Struggling and Start Living: A Guide to ACT by Russ Harris"
            ]
        },
        {
            "tag": "Emotional distress",
            "patterns": [
                "I'm feeling really down today.",
                "I'm feeling sad and can't seem to shake it off.",
                "I'm feeling low and just need some time to myself.",
                "I'm not myself lately and feel really sad.",
                "I'm feeling blue and can't seem to find any joy.",
                "I'm feeling really emotional and don't know why.",
                "I'm feeling heartbroken and can't stop crying.",
                "I'm having a hard time shaking off this feeling",
                "I feel like I'm in a dark place",
                "I'm struggling to cope right now",
                "I'm feeling really down in the dumps",
                "I feel like crying",
                "I'm not doing okay",
                "I'm not feeling like myself lately",
                "I feel like everything is overwhelming and I can't keep up.",
                "I'm struggling to find meaning or purpose in my life.",
                "I feel like I'm stuck in a rut and can't break free.",
                "I'm feeling hopeless and like there's no way out of this.",
                "I'm constantly anxious and can't seem to relax.",
                "I'm feeling really insecure and doubting myself a lot.",
                "I'm dealing with a lot of guilt and shame.",
                "I'm constantly second-guessing myself and my decisions.",
                "I'm feeling really isolated and alone.",
                "I'm struggling with my self-esteem and self-worth.",
                "I'm feeling like I don't belong anywhere or with anyone.",
                "I'm dealing with a lot of unresolved trauma and it's affecting my daily life.",
                "I'm feeling really angry and resentful towards others.",
                "I'm experiencing a lot of physical symptoms like headaches, fatigue, and muscle tension.",
                "I'm feeling like I can't trust anyone and everyone is out to get me.",
                "I'm feeling overwhelmed by my responsibilities and can't seem to catch a break.",
                "I'm struggling to come to terms with a recent loss or difficult life event.",
                "I'm feeling really stuck and like I can't make any progress in my life.",
                "I'm dealing with a lot of unresolved anger and it's affecting my relationships.",
                "I'm feeling really anxious about the future and what it holds for me.",
                "I'm having a hard time sleeping and it's affecting my ability to function during the day.",
                "I'm feeling like I've lost my sense of purpose and direction in life.",
                "I'm struggling with addiction and can't seem to break free from it.",
                "I'm feeling really stressed out and like I can't handle any more pressure.",
                "I'm dealing with a lot of self-doubt and negative self-talk.",
                "I'm feeling really jealous and insecure in my relationships.",
                "I'm experiencing a lot of mood swings and can't seem to regulate my emotions.",
                "I'm feeling really detached from my emotions and like I'm just going through the motions.",
                "I'm dealing with a lot of unresolved childhood issues and it's affecting my adult life.",
                "I'm feeling really overwhelmed by my past mistakes and can't seem to forgive myself.",
                "I'm feeling really frustrated with myself and my situation.",
                "I'm struggling to find motivation to do anything.",
                "I'm feeling like I don't have anyone to turn to for support.",
                "I'm dealing with a lot of guilt over things I've done in the past.",
                "I'm feeling really lost and like I don't know what to do with my life.",
                "I'm having a hard time expressing my emotions to others.",
                "I'm feeling really empty and like nothing can fill the void.",
                "I'm struggling to find meaning in my daily life.",
                "I'm feeling like I'm not living up to my potential.",
                "I'm dealing with a lot of unresolved resentment towards others.",
                "I'm feeling like I'm not good enough for anyone or anything.",
                "I'm having a hard time forgiving others for past hurts.",
                "I'm feeling really disconnected from myself and others.",
                "I'm struggling to trust others after being hurt in the past.",
                "I'm feeling like my life is out of my control and I don't know what to do about it.",
                "I feel like I'm on an emotional rollercoaster.",
                "I'm dealing with a lot of shame and it's affecting my self-esteem.",
                "I'm feeling really anxious and it's hard to control my thoughts.",
                "I'm struggling with a lot of self-doubt and it's affecting my decision-making.",
                "I feel like I'm drowning in my emotions and can't seem to find a way out.",
                "I'm dealing with a lot of fear and it's holding me back from living my life.",
                "I'm feeling really overwhelmed by my emotions and it's hard to cope.",
                "I'm experiencing a lot of anger and it's affecting my relationships with others.",
                "I'm struggling with a lot of sadness and it's hard to find joy in anything.",
                "I feel like my emotions are consuming me and I can't escape them.",
                "I'm dealing with a lot of grief and it's affecting my daily life.",
                "I'm feeling really insecure and it's hard to feel confident in myself.",
                "I'm experiencing a lot of guilt and it's hard to forgive myself for past mistakes.",
                "I'm struggling to deal with a traumatic event from my past.",
                "I feel like I'm constantly on edge and it's hard to relax.",
                "I'm dealing with a lot of loneliness and it's hard to connect with others.",
                "I'm feeling really sensitive and it's easy for me to get hurt.",
                "I'm struggling with a lot of shame over things that aren't my fault.",
                "I feel like I'm always on the verge of tears and it's hard to hold it together.",
                "I'm dealing with a lot of jealousy and it's affecting my relationships with others.",
                "I'm feeling really confused and it's hard to make sense of my emotions.",
                "I'm experiencing a lot of regret over past decisions and it's hard to move on.",
                "I'm struggling to deal with a chronic illness and the emotional toll it takes on me.",
                "I feel like I'm carrying a heavy emotional burden and it's hard to let go.",
                "I'm dealing with a lot of self-criticism and it's hard to be kind to myself.",
                "I'm feeling really vulnerable and it's hard to trust others.",
                "I'm experiencing a lot of disappointment and it's hard to stay positive.",
                "I'm struggling with a lot of resentment towards others and it's hard to let go.",
                "I feel like I'm walking on eggshells around others and it's hard to relax.",
                "I'm dealing with a lot of self-pity and it's hard to see the good in my life.",
                "I'm feeling really overwhelmed by my responsibilities and it's hard to keep up.",
                "I'm experiencing a lot of frustration and it's hard to stay patient.",
                "I'm struggling with a lot of self-sabotage and it's hard to make progress.",
                "I feel like I'm in a constant state of emotional turmoil and it's hard to find peace.",
                "I'm dealing with a lot of resentment towards myself and it's hard to forgive.",
                "I'm feeling really drained and it's hard to find motivation.",
                "I'm experiencing a lot of emotional numbness and it's hard to feel anything.",
                "I'm struggling with a lot of self-blame and it's hard to take responsibility.",
                "I feel like I'm in a dark place and it's hard to see the light.",
                "I'm dealing with a lot of self-deprecation and it's hard",
                "I'm feeling overwhelmed and it's affecting my ability to function.",
                "I'm experiencing a lot of anxiety and can't seem to calm down.",
                "I'm feeling really sad and hopeless right now.",
                "I'm dealing with a lot of grief and can't seem to move on.",
                "I'm feeling really angry and don't know how to deal with it.",
                "I'm struggling with a lot of shame and guilt.",
                "I'm feeling really scared and don't know how to cope.",
                "I'm dealing with a lot of trauma and it's affecting my daily life.",
                "I'm feeling really lonely and isolated right now.",
                "I'm experiencing a lot of panic attacks and don't know what to do.",
                "I'm feeling really overwhelmed by my emotions and don't know how to regulate them.",
                "I'm dealing with a lot of self-hatred and negative self-talk.",
                "I'm feeling really numb and detached from my emotions.",
                "I'm struggling to find meaning in my life and feel really lost.",
                "I'm feeling really envious and jealous of others.",
                "I'm dealing with a lot of self-doubt and it's affecting my confidence.",
                "I'm feeling really guilty about something I did and can't seem to forgive myself.",
                "I'm experiencing a lot of physical symptoms like headaches and stomach aches.",
                "I'm feeling really overwhelmed by my relationships and don't know how to handle them.",
                "I'm dealing with a lot of fear and uncertainty about the future.",
                "I'm feeling really stuck in my life and don't know how to make progress.",
                "I'm experiencing a lot of shame and embarrassment about something.",
                "I'm feeling really insecure and don't know how to improve my self-esteem.",
                "I'm struggling to trust others and feel really guarded.",
                "I'm feeling really vulnerable and don't know how to protect myself.",
                "I'm dealing with a lot of anger towards someone and don't know how to communicate it.",
                "I'm feeling really rejected and hurt by someone.",
                "I'm experiencing a lot of guilt and shame about something I said.",
                "I'm feeling really overwhelmed by my responsibilities and can't seem to handle them.",
                "I'm dealing with a lot of resentment towards someone and don't know how to let it go.",
                "I'm feeling really disappointed in myself and my accomplishments.",
                "I'm struggling to cope with a recent loss or difficult life event.",
                "I'm feeling really pessimistic about the future and don't see things improving.",
                "I'm experiencing a lot of social anxiety and don't know how to interact with others.",
                "I'm feeling really helpless and don't know how to change my situation.",
                "I'm dealing with a lot of regret about something I did in the past.",
                "I'm feeling really misunderstood by others and don't know how to express myself.",
                "I'm experiencing a lot of self-pity and don't know how to break out of it.",
                "I'm feeling really overwhelmed by my negative thoughts and don't know how to stop them.",
                "I'm dealing with a lot of jealousy and envy towards others.",
                "I'm feeling really exhausted and burnt out.",
                "I'm struggling with a lot of indecision and can't seem to make a choice.",
                "I'm feeling really irritable and easily annoyed by others.",
                "I'm experiencing a lot of guilt and shame about something I didn't do.",
                "I'm feeling really self-conscious and don't know how to stop caring what",
                "I feel like my emotions are all over the place.",
                "I'm experiencing a lot of anxiety and can't seem to calm down.",
                "I'm feeling really overwhelmed by my responsibilities and commitments.",
                "I'm struggling to cope with a recent breakup or loss.",
                "I'm feeling really irritable and on edge.",
                "I'm dealing with a lot of self-doubt and insecurity.",
                "I'm experiencing a lot of shame and guilt over past actions.",
                "I'm feeling really hopeless about the future.",
                "I'm struggling with feelings of worthlessness and inadequacy.",
                "I'm feeling really angry and resentful towards someone or something.",
                "I'm dealing with a lot of grief and can't seem to move on.",
                "I'm feeling really lonely and isolated.",
                "I'm experiencing a lot of negative thoughts and emotions.",
                "I'm feeling really exhausted and burnt out.",
                "I'm struggling to find joy in things that used to make me happy.",
                "I'm feeling really disconnected from myself and others.",
                "I'm dealing with a lot of unresolved trauma and it's affecting my daily life.",
                "I'm feeling really scared and anxious about the future.",
                "I'm experiencing a lot of physical symptoms like headaches, nausea, and muscle tension.",
                "I'm feeling really trapped and like there's no way out of my situation.",
                "I'm struggling to communicate my feelings effectively to others.",
                "I'm feeling really overwhelmed by my negative thoughts and emotions.",
                "I'm dealing with a lot of self-hatred and self-criticism.",
                "I'm feeling really numb and like I can't experience emotions fully.",
                "I'm experiencing a lot of panic attacks and can't seem to control them.",
                "I'm feeling really guilty for not being able to handle everything on my own.",
                "I'm struggling to find meaning and purpose in my life.",
                "I'm feeling really ashamed of my past mistakes and can't seem to forgive myself.",
                "I'm dealing with a lot of anxiety and fear of rejection.",
                "I'm feeling really lost and like I don't know who I am anymore.",
                "I'm experiencing a lot of self-sabotaging behaviors and can't seem to stop them.",
                "I'm feeling really stuck and like I can't make any progress in my life.",
                "I'm struggling to find the motivation to take care of myself.",
                "I'm feeling really overwhelmed by my negative self-talk.",
                "I'm dealing with a lot of unresolved issues from my childhood.",
                "I'm feeling really jealous and insecure in my relationships.",
                "I'm experiencing a lot of mood swings and can't seem to regulate my emotions.",
                "I'm feeling really alone and like no one understands me.",
                "I'm struggling to find a sense of belonging and acceptance.",
                "I'm feeling really defeated and like I can't overcome my problems.",
                "I'm dealing with a lot of anxiety and fear of the unknown.",
                "I'm feeling really helpless and like there's nothing I can do to improve my situation.",
                "I'm experiencing a lot of self-doubt and indecision.",
                "I'm feeling really disconnected from my body and my surroundings.",
                "I'm struggling to find a balance between my emotions and my actions.",
                "I'm feeling really vulnerable and exposed.",
                "I'm dealing with a lot of unresolved anger towards myself and others.",
                "I'm feeling really anxious about my relationships and whether they'll last.",
                "I feel like I'm constantly on edge and can't relax.",
                "I'm dealing with a lot of fear and anxiety.",
                "I'm struggling with feelings of worthlessness and hopelessness.",
                "I'm having a hard time regulating my emotions.",
                "I'm feeling really overwhelmed and like I can't handle anything else.",
                "I'm experiencing a lot of guilt and shame over things I've done.",
                "I'm feeling really insecure and like I'm not good enough.",
                "I'm struggling with feelings of sadness and despair.",
                "I'm dealing with a lot of anger and resentment towards others.",
                "I'm feeling really lonely and isolated.",
                "I'm having a hard time coping with stress and pressure.",
                "I'm experiencing a lot of physical symptoms like headaches, stomach aches, and fatigue.",
                "I'm feeling like I'm stuck in a negative cycle and can't break free.",
                "I'm struggling with feelings of grief and loss.",
                "I'm having a hard time trusting others.",
                "I'm feeling like I'm constantly in a state of crisis.",
                "I'm dealing with a lot of trauma and it's affecting my daily life.",
                "I'm feeling really hopeless about the future.",
                "I'm struggling with self-doubt and negative self-talk.",
                "I'm experiencing a lot of mood swings and can't seem to control my emotions.",
                "I'm feeling like I'm always on the verge of a breakdown.",
                "I'm dealing with a lot of unresolved issues from my past.",
                "I'm feeling really overwhelmed by my responsibilities and obligations.",
                "I'm struggling with feelings of jealousy and insecurity in my relationships.",
                "I'm having a hard time communicating my needs to others.",
                "I'm feeling like I'm constantly walking on eggshells around others.",
                "I'm dealing with a lot of shame and embarrassment over my actions.",
                "I'm feeling like I'm losing my grip on reality.",
                "I'm struggling to find meaning and purpose in my life.",
                "I'm experiencing a lot of panic attacks and anxiety.",
                "I'm feeling really disconnected from others and myself.",
                "I'm having a hard time making decisions and sticking to them.",
                "I'm feeling like I'm constantly in a state of chaos.",
                "I'm dealing with a lot of unresolved anger and it's affecting my relationships.",
                "I'm feeling like I'm never good enough no matter how hard I try.",
                "I'm struggling to cope with change and uncertainty.",
                "I'm experiencing a lot of self-doubt and questioning my abilities.",
                "I'm feeling like I'm in a dark place and can't see a way out.",
                "I'm having a hard time accepting myself for who I am.",
                "I'm dealing with a lot of self-destructive behavior and can't seem to stop.",
                "I'm feeling really hopeless and like there's no way out of my situation.",
                "I'm struggling to find the motivation to do anything.",
                "I'm experiencing a lot of tension and conflict in my relationships.",
                "I'm feeling like I'm constantly being judged by others.",
                "I'm having a hard time coping with rejection and failure.",
                "I'm dealing with a lot of unresolved issues in my relationships.",
                "I'm feeling really overwhelmed by my thoughts and emotions.",
                "I'm struggling to find balance in my life.",
                "I'm experiencing a lot of shame and guilt over my past actions.",
                "I'm feeling like I'm not living up to my full potential."
            ],
            "responses": [
                "The Body Keeps the Score: Brain, Mind, and Body in the Healing of Trauma by Bessel van der Kolk",
                "Running on Empty: Overcome Your Childhood Emotional Neglect by Jonice Webb",
                "Mind Over Mood: Change How You Feel by Changing the Way You Think by Dennis Greenberger and Christine A. Padesky",
                "Trauma and Recovery: The Aftermath of Violence--From Domestic Abuse to Political Terror by Judith Herman"
            ]
        },
        {
            "tag": "Work stress",
            "patterns": [
                "I'm feeling burnt out and exhausted from work.",
                "I'm struggling to cope with everything that's going on.",
                "I'm feeling like I have too much on my plate.",
                "I'm feeling like I can't keep up with everything.",
                "I'm not getting the support I need at work",
                "I'm having a hard time balancing work and my personal life",
                "I'm feeling really overwhelmed with my workload and it's causing a lot of stress.",
                "I'm experiencing a lot of pressure to meet deadlines and it's affecting my ability to perform.",
                "I'm feeling really burnt out and exhausted from work and I don't know how to recharge.",
                "I'm struggling with a difficult coworker or boss and it's causing me a lot of stress and anxiety.",
                "I'm feeling really unappreciated and undervalued in my job and it's affecting my motivation.",
                "I'm experiencing a lot of work-related stress outside of work hours and it's affecting my personal life.",
                "I'm feeling really anxious about job security and it's causing me a lot of stress and worry.",
                "I'm struggling to maintain a work-life balance and it's affecting my overall well-being.",
                "I'm feeling a lot of pressure to constantly be available and connected to work and it's causing me stress.",
                "I'm experiencing a lot of stress and anxiety related to a project or task that I'm working on.",
                "I'm feeling really overwhelmed by the amount of emails and communication I receive at work.",
                "I'm experiencing a lot of stress related to public speaking or presentations at work.",
                "I'm feeling really frustrated with a lack of support or resources in my job and it's causing me stress.",
                "I'm struggling with a difficult or unfulfilling work environment and it's affecting my overall well-being.",
                "I'm feeling a lot of pressure to constantly be productive and it's causing me stress and burnout.",
                "I'm experiencing a lot of stress related to a lack of clarity or direction in my job responsibilities.",
                "I'm feeling really anxious about making mistakes or not meeting expectations in my job.",
                "I'm struggling with a heavy workload and it's causing me stress and anxiety.",
                "I'm feeling really stressed and overwhelmed by the need to multitask and juggle multiple responsibilities at work.",
                "I'm experiencing a lot of stress and anxiety related to a work-related conflict or dispute.",
                "I'm feeling really stressed and overwhelmed with the constant changes and updates in my job.",
                "I'm experiencing a lot of stress related to meeting sales or revenue targets in my job.",
                "I'm feeling really anxious about job performance reviews and it's causing me stress and worry.",
                "I'm struggling with a toxic or negative work culture and it's affecting my mental health.",
                "I'm feeling really stressed and anxious about a new project or initiative that I'm working on.",
                "I'm experiencing a lot of pressure to work long hours or overtime and it's causing me stress and burnout.",
                "I'm feeling really frustrated with a lack of communication or transparency from management in my job.",
                "I'm struggling with a difficult or unsupportive team dynamic and it's causing me stress and anxiety.",
                "I'm feeling a lot of pressure to constantly improve my skills or knowledge in my job and it's causing me stress.",
                "I'm experiencing a lot of stress related to a difficult or high-pressure client or customer.",
                "I'm feeling really stressed and anxious about meeting the expectations of my boss or colleagues.",
                "I'm experiencing a lot of stress related to a lack of autonomy or control over my work responsibilities.",
                "I'm feeling really overwhelmed with the amount of information and data I need to process in my job.",
                "I'm struggling with a difficult or unsupportive mentor or supervisor in my job.",
                "I'm feeling really stressed and anxious about a work-related deadline or project.",
                "I'm experiencing a lot of stress related to a lack of support or resources in my job.",
                "I'm feeling really overwhelmed with the amount of work I have to do and it's causing me stress and anxiety.",
                "I'm experiencing a lot of stress related to a lack of clarity or direction in my job responsibilities.",
                "I'm sorry to hear that you're feeling burnt out and exhausted from work. It's important to take care of yourself and prioritize self-care during times of stress. Have you considered talking to your supervisor or HR representative about how you're feeling?",
                "Work stress can be incredibly challenging to deal with. Have you tried any stress-management techniques, such as meditation or exercise?",
                "It's understandable that you're feeling overwhelmed with everything going on. Have you considered delegating some of your responsibilities or talking to your supervisor about adjusting your workload?",
                "Feeling like you can't keep up with everything can be really stressful. Have you tried making a to-do list or breaking down your tasks into smaller, more manageable steps?",
                "Not getting the support you need at work can be frustrating and stressful. Have you talked to your supervisor or HR representative about your concerns?",
                "Balancing work and personal life can be difficult, especially during stressful times. Have you considered setting boundaries and creating a schedule that prioritizes self-care?",
                "Feeling overwhelmed with your workload can be really challenging. Have you talked to your supervisor about adjusting your workload or delegating some of your responsibilities?",
                "Feeling pressure to meet deadlines can be incredibly stressful. Have you talked to your supervisor about adjusting your deadlines or asking for additional support?",
                "Feeling burnt out and exhausted from work is a common experience. Have you considered taking a break or a vacation to recharge?",
                "Dealing with a difficult coworker or boss can be incredibly challenging. Have you talked to HR or a supervisor about the situation?",
                "Feeling unappreciated or undervalued can be really demotivating. Have you talked to your supervisor or HR representative about your concerns?",
                "Experiencing work-related stress outside of work hours can be really challenging. Have you considered setting boundaries and creating a schedule that prioritizes self-care?",
                "Job security can be a major source of stress. Have you talked to your supervisor or HR representative about the company's plans for the future?",
                "Maintaining a work-life balance can be really challenging. Have you considered setting boundaries and creating a schedule that prioritizes self-care?",
                "Feeling pressure to constantly be available and connected to work can be really stressful. Have you considered setting boundaries and creating a schedule that prioritizes self-care?",
                "Experiencing stress and anxiety related to a project or task is a common experience. Have you talked to your supervisor or a colleague about your concerns?",
                "Feeling overwhelmed by emails and communication is a common experience. Have you considered setting aside specific times during the day to check your emails and respond to communication?",
                "Stress related to public speaking or presentations is a common experience. Have you considered practicing your presentation or seeking feedback from a colleague?",
                "Feeling frustrated with a lack of support or resources is a common experience. Have you talked to your supervisor or HR representative about your concerns?",
                "Dealing with a difficult or unfulfilling work environment can be really challenging. Have you considered talking to HR or a supervisor about the situation?",
                "Feeling pressure to constantly be productive can be really stressful. Have you considered setting realistic goals and prioritizing self-care?",
                "Feeling stress related to a lack of clarity or direction in your job responsibilities is a common experience. Have you talked to your supervisor or HR representative about your concerns?",
                "Feeling anxious about making mistakes or not meeting expectations is a common experience. Have you talked to your supervisor or a colleague about your concerns?",
                "I'm feeling a lot of pressure to constantly be available or responsive to work-related communication and it's causing me stress.",
                "I'm experiencing a lot of stress related to a lack of clear direction or guidance in my job.",
                "I'm feeling really anxious about making mistakes or being perceived as incompetent in my job.",
                "I'm struggling with a lack of recognition or reward for my hard work in my job.",
                "I'm feeling really overwhelmed by the workload and it's causing me stress and anxiety.",
                "I'm struggling to meet the demands of my job and it's affecting my mental health.",
                "I'm feeling a lot of pressure to be perfect in my job and it's causing me stress and anxiety.",
                "I'm experiencing a lot of stress and anxiety related to a difficult or time-sensitive project.",
                "I'm feeling really burnt out and in need of a break from work.",
                "I'm having a hard time sleeping because I'm so stressed about work.",
                "I'm feeling really stressed and anxious about an upcoming performance review.",
                "I'm struggling to stay motivated at work and it's causing me stress and anxiety.",
                "I'm feeling really overwhelmed by the amount of responsibility I have at work.",
                "I'm experiencing a lot of stress and anxiety related to a lack of work-life balance.",
                "I'm feeling really stressed and anxious about a looming deadline.",
                "I'm struggling to keep up with the demands of my job and it's affecting my personal life.",
                "I'm feeling really frustrated with the lack of support I'm getting at work.",
                "I'm experiencing a lot of stress and anxiety related to a difficult or challenging project.",
                "I'm feeling really anxious about losing my job and it's causing me a lot of stress.",
                "I'm struggling to maintain a positive attitude at work and it's causing me stress and burnout.",
                "I'm feeling really stressed and anxious about a recent mistake I made at work.",
                "I'm experiencing a lot of stress and anxiety related to a lack of clarity or direction in my job.",
                "I'm feeling really overwhelmed by the constant flow of emails and messages I receive at work.",
                "I'm struggling to stay focused and productive at work and it's causing me stress and anxiety.",
                "I'm feeling really anxious about a big presentation or pitch I have to give at work.",
                "I'm experiencing a lot of stress and anxiety related to a difficult or challenging coworker.",
                "I'm feeling really stressed and anxious about a new project or responsibility that I've been given.",
                "I'm struggling to stay organized and on top of my workload and it's causing me stress and anxiety.",
                "I'm feeling really stressed and anxious about a change in management or company direction.",
                "I'm experiencing a lot of stress and anxiety related to a difficult or toxic work environment.",
                "I'm feeling really overwhelmed by the number of meetings and conference calls I have to attend at work.",
                "I'm struggling to balance my work responsibilities with my personal life and it's causing me stress and burnout.",
                "I'm feeling really stressed and anxious about a difficult or confrontational conversation I need to have at work.",
                "I'm experiencing a lot of stress and anxiety related to a lack of feedback or recognition for my work.",
                "I'm feeling really stressed and anxious about a lack of job security or instability in my industry.",
                "I'm struggling to cope with the pressures and expectations of my job and it's affecting my mental health.",
                "I'm feeling a lot of pressure to constantly be competitive and outperform others in my job.",
                "I'm experiencing a lot of stress and anxiety related to a high-stakes project at work."
            ],
            "responses": [
                "The 5 AM Club: Own Your Morning, Elevate Your Life by Robin Sharma",
                "The Power of Full Engagement: Managing Energy, Not Time, Is the Key to High Performance and Personal Renewal by Jim Loehr and Tony Schwartz",
                "The Stress Solution: The 4 Steps to Reset Your Body, Mind, Relationships and Purpose by Dr. Rangan Chatterjee",
                "Drive: The Surprising Truth About What Motivates Us by Daniel H. Pink"
            ]
        },
        {
            "tag": "Academic stress",
            "patterns": [
                "I'm so stressed out about my exams.",
                "I have so many assignments due and not enough time to complete them.",
                "I'm feeling overwhelmed with schoolwork.",
                "I feel like I'm falling behind in my classes",
                "I have too much to do for school right now",
                "I'm feeling like I'm losing motivation",
                "I'm feeling like I'm not making progress",
                "I'm feeling like I'm not smart enough",
                "I'm feeling a lot of pressure to succeed",
                "I'm feeling really anxious about my grades",
                "I'm feeling really overwhelmed with the amount of coursework and assignments I have to complete.",
                "I'm experiencing a lot of stress related to studying for exams and assessments.",
                "I'm feeling really anxious about my academic performance and it's causing me stress and worry.",
                "I'm struggling with a difficult or unsupportive teacher or professor and it's affecting my academic progress.",
                "I'm feeling a lot of pressure to constantly excel academically and it's causing me stress and anxiety.",
                "I'm experiencing a lot of stress related to a lack of time management or organization in my studies.",
                "I'm feeling really frustrated with a lack of clarity or direction in my academic program and it's causing me stress.",
                "I'm struggling with a heavy workload and it's causing me stress and burnout in my studies.",
                "I'm feeling a lot of pressure to balance my academic work with other responsibilities and it's causing me stress.",
                "I'm experiencing a lot of stress and anxiety related to a major academic project or thesis.",
                "I'm feeling really stressed and anxious about meeting the academic expectations of my parents or family.",
                "I'm experiencing a lot of stress related to navigating the social pressures and dynamics of the academic environment.",
                "I'm feeling really overwhelmed with the amount of extracurricular activities and commitments I have in addition to my academic work.",
                "I'm struggling with a lack of motivation or interest in my academic program and it's affecting my academic performance.",
                "I'm feeling a lot of pressure to choose the right career path or academic program and it's causing me stress and anxiety.",
                "I'm experiencing a lot of stress related to the competition and comparison among peers in my academic program.",
                "I'm feeling really anxious about the future and the impact of my academic performance on my career prospects.",
                "I'm struggling with a lack of support or guidance from academic advisors or mentors.",
                "I'm struggling to keep up with my academic workload.",
                "I'm feeling really stressed about my upcoming exams.",
                "I'm feeling like I'm not good enough to succeed academically.",
                "I'm feeling a lot of pressure to maintain a high GPA.",
                "I'm feeling really overwhelmed with my coursework.",
                "I'm feeling like I'm not getting enough support from my teachers or professors.",
                "I'm feeling really anxious about my academic performance.",
                "I'm experiencing a lot of stress related to the pressure to succeed in my academic program.",
                "I'm feeling really burnt out from all of my academic responsibilities.",
                "I'm struggling with a lack of motivation to complete my schoolwork.",
                "I'm feeling really anxious about the future and my academic prospects.",
                "I'm experiencing a lot of stress related to the workload in my academic program.",
                "I'm feeling really overwhelmed with the expectations placed on me as a student.",
                "I'm feeling a lot of pressure to excel in all areas of my academic program.",
                "I'm struggling to balance my academic responsibilities with my personal life.",
                "I'm feeling really stressed about my academic deadlines.",
                "I'm feeling like I'm not getting enough recognition for my academic achievements.",
                "I'm feeling really anxious about the amount of work I have to do for my classes.",
                "I'm experiencing a lot of stress related to the pressure to perform well in my academic program.",
                "I'm feeling really overwhelmed with the amount of studying I have to do.",
                "I'm feeling like I'm not making progress in my academic program.",
                "I'm feeling a lot of pressure to be the best in my academic program.",
                "I'm struggling with a lack of resources to help me succeed academically.",
                "I'm feeling really stressed about the expectations placed on me by my parents or family.",
                "I'm feeling like I'm not getting enough feedback on my academic work.",
                "I'm feeling really anxious about the impact of my academic performance on my future career prospects.",
                "I'm experiencing a lot of stress related to the pressure to succeed in my academic program while also maintaining a social life.",
                "I'm feeling really overwhelmed with the amount of reading I have to do for my classes.",
                "I'm feeling like I'm not getting enough sleep because of my academic responsibilities.",
                "I'm feeling a lot of pressure to choose the right major or academic program.",
                "I'm struggling to manage my time effectively in order to complete all of my academic work.",
                "I'm feeling a lot of pressure to balance academic work with personal relationships and it's causing me stress.",
                "I'm experiencing a lot of stress and anxiety related to the pressure to pursue advanced degrees or academic accolades.",
                "I'm feeling really stressed about the upcoming deadlines for my academic assignments.",
                "I'm feeling like I'm not getting enough support from my classmates to succeed academically.",
                "I'm feeling really anxious about the upcoming exams and assessments.",
                "I'm experiencing a lot of stress related to the pressure to be perfect in my academic program.",
                "I'm feeling really overwhelmed with the amount of information I have to remember for my classes.",
                "I'm feeling like I'm not getting enough time to relax and take care of myself while juggling my academic responsibilities.",
                "I'm feeling really anxious about the competitive nature of my academic program.",
                "I'm experiencing a lot of stress related to the pressure to maintain a high level of academic performance.",
                "I'm feeling really burnt out from constantly trying to meet the high expectations of my academic program.",
                "I'm struggling with a lack of confidence in my academic abilities.",
                "I'm feeling like I'm not getting enough recognition for my hard work and achievements in my academic program.",
                "I'm feeling really anxious about the impact of my academic performance on my mental health.",
                "I'm experiencing a lot of stress related to the pressure to succeed in my academic program in order to secure my future career prospects.",
                "I'm feeling really overwhelmed with the amount of group projects and assignments I have to complete.",
                "I'm feeling like I'm not getting enough individual attention from my teachers or professors.",
                "I'm feeling a lot of pressure to participate in extracurricular activities in addition to my academic workload.",
                "I'm struggling with a lack of motivation to continue pursuing my academic goals.",
                "I'm feeling really anxious about the impact of my academic performance on my scholarship or financial aid.",
                "I'm experiencing a lot of stress related to the pressure to balance my academic responsibilities with my work or job.",
                "I'm feeling really overwhelmed with the amount of research I have to do for my academic projects.",
                "I'm feeling like I'm not getting enough feedback on my academic progress and performance.",
                "I'm feeling a lot of pressure to maintain a social life while also succeeding academically.",
                "I'm struggling with a lack of resources to help me manage my academic stress and anxiety.",
                "I'm feeling really anxious about the impact of my academic performance on my relationships with my family and friends.",
                "I'm experiencing a lot of stress related to the pressure to succeed in my academic program while also taking care of my physical health.",
                "I'm feeling really overwhelmed with the amount of information I have to process and understand for my classes.",
                "I'm feeling like I'm not getting enough support from my academic advisors or mentors.",
                "I'm feeling a lot of pressure to succeed academically in order to prove my worth to myself and others.",
                "I'm struggling to cope with the stress and pressure of my academic program."
            ],
            "responses": [
                "How to Read a Book by Mortimer Adler and Charles Van Doren",
                "Make It Stick: The Science of Successful Learning by Peter C. Brown, Henry L. Roediger III, and Mark A. McDaniel",
                "A Mind for Numbers: How to Excel at Math and Science (Even If You Flunked Algebra) by Barbara Oakley",
                "Deep Work: Rules for Focused Success in a Distracted World by Cal Newport"
            ]
        },
        {
            "tag": "General stress",
            "patterns": [
                "I'm feeling like I'm at my breaking point.",
                "I'm feeling like I need a break.",
                "I'm feeling really stressed out right now.",
                "I'm under a lot of pressure and feeling overwhelmed.",
                "I'm really anxious and don't know how to calm down.",
                "I'm feeling tense and can't seem to relax.",
                "I'm feeling like I'm at my breaking point.",
                "I'm feeling like I need a break.",
                "I'm feeling really stressed out right now.",
                "I'm under a lot of pressure and feeling overwhelmed.",
                "I'm really anxious and don't know how to calm down.",
                "I'm feeling tense and can't seem to relax.",
                "Everything is just too much right now.",
                "I'm struggling to cope with everything going on.",
                "I'm having trouble sleeping because I'm so stressed.",
                "I'm worried about the future and what it holds.",
                "I feel like I'm carrying the weight of the world on my shoulders.",
                "I'm having trouble concentrating because I'm so stressed out.",
                "I feel like I'm on edge all the time.",
                "I'm finding it hard to enjoy anything because I'm so stressed.",
                "I just want to curl up and hide away from everything.",
                "I'm snapping at people for no reason because I'm so stressed.",
                "I'm constantly worried that I'm not doing enough or doing things right.",
                "I feel like I'm drowning and can't seem to catch my breath.",
                "I'm struggling to keep up with my responsibilities because of my stress levels.",
                "I'm feeling like I'm in a constant state of fight or flight.",
                "I'm feeling really overwhelmed and don't know how to prioritize everything.",
                "I'm constantly worrying about things that are out of my control.",
                "I'm feeling like I'm stuck in a rut and can't seem to move forward.",
                "I'm feeling like I'm not good enough and can't meet my own expectations.",
                "I'm feeling like I'm falling behind and can't seem to catch up.",
                "I'm having trouble getting motivated to do anything because I'm so stressed.",
                "I'm feeling like I'm trapped and don't know how to break free.",
                "I'm feeling like I'm in a constant state of chaos and can't seem to get organized.",
                "I'm feeling like I'm burning the candle at both ends and can't keep up.",
                "I'm feeling like I'm always on the go and can't seem to slow down.",
                "I'm feeling like I'm being pulled in a million different directions.",
                "I'm feeling like I'm running on empty and can't seem to recharge.",
                "I'm feeling like I'm carrying a heavy burden and can't seem to lighten the load.",
                "I'm feeling like I'm alone in my stress and no one else understands.",
                "I'm feeling like I'm constantly fighting a losing battle.",
                "I'm feeling like my stress is taking over my life and I don't know how to regain control.",
                "I'm feeling like I'm stuck in a never-ending cycle of stress and can't seem to break free.",
                "I'm feeling like I'm at my wit's end and can't handle anything else.",
                "I'm feeling like I'm drowning in a sea of stress and can't seem to stay afloat.",
                "I'm feeling like I'm walking on eggshells and can't seem to relax.",
                "I'm feeling like I'm stuck in a vicious cycle of stress and can't seem to break free.",
                "I'm feeling like I'm constantly battling my own thoughts and emotions.",
                "I'm feeling like I'm losing my grip on reality and can't seem to get a hold of myself.",
                "I'm feeling like I'm constantly on the verge of a breakdown and can't seem to keep it together.",
                "I'm feeling like I'm living in a constant state of uncertainty and can't seem to find stability.",
                "I'm feeling like I'm in a constant state of alert and can't seem to relax.",
                "I'm feeling like I'm trapped in a cage of stress and can't seem to break free.",
                "I'm feeling like I'm on a rollercoaster of emotions and can't seem to find steady ground.",
                "I'm feeling like I'm carrying the weight of the world on my shoulders and can't seem to find relief.",
                "I'm feeling like I'm lost in a sea of responsibilities and can't seem to find my way out.",
                "I'm feeling like I'm constantly playing catch-up and can't seem to get ahead.",
                "I'm feeling like I'm stuck in a rut and can't seem to find a way out.",
                "I'm feeling like I'm in a constant battle with myself and can't seem to find peace.",
                "I'm feeling like I'm walking on eggshells and can't seem to relax.",
                "I'm feeling like I'm on a never-ending treadmill and can't seem to get off.",
                "I'm feeling like I'm lost in a maze and can't seem to find my way out.",
                "I'm feeling like I'm constantly trying to keep up with everyone else and can't seem to catch a break.",
                "I'm feeling like I'm stuck in a downward spiral and can't seem to climb back up.",
                "I'm feeling like I'm living in a world of chaos and can't seem to find order.",
                "I'm feeling like I'm drowning in a sea of responsibilities and can't seem to stay afloat.",
                "I'm feeling like I'm trapped in a cycle of stress and can't seem to break free.",
                "I'm feeling like I'm constantly battling against time and can't seem to catch up.",
                "I'm feeling like I'm constantly walking on thin ice and can't seem to find solid ground.",
                "I'm feeling like I'm running on empty and can't seem to refuel.",
                "I'm feeling like I'm living in a constant state of emergency and can't seem to find respite.",
                "I'm feeling like I'm stuck in a rut and can't seem to find a way out.",
                "I'm feeling like I'm constantly teetering on the edge and can't seem to find balance.",
                "I'm feeling like I'm living in a fog and can't seem to see clearly.",
                "I'm feeling like I'm constantly juggling too many things and can't seem to keep them all in the air.",
                "I'm feeling like I'm in a tug-of-war with myself and can't seem to find a compromise.",
                "I'm feeling like I'm constantly in survival mode and can't seem to find a way to thrive.",
                "I'm feeling like I'm living in a world of noise and can't seem to find peace and quiet.",
                "I'm feeling like I'm living in a constant state of alert and can't seem to relax.",
                "I'm feeling like I'm in a maze with no end in sight and can't seem to find the way out.",
                "I'm feeling like I'm constantly in a battle with my own mind and can't seem to find peace.",
                "I'm feeling like I'm carrying a heavy burden and can't seem to put it down.",
                "I'm feeling like I'm stuck in a whirlwind and can't seem to slow down.",
                "I'm feeling like I'm constantly in a race against time and can't seem to catch up.",
                "I'm feeling like I'm in a constant state of crisis and can't seem to find a solution.",
                "I'm feeling like I'm living in a world that's moving too fast for me to keep up.",
                "I'm feeling like I'm constantly in a state of chaos and can't seem to find calm.",
                "I'm feeling like I'm walking on a tightrope and can't seem to find balance.",
                "I'm feeling like I'm in a dark place and can't seem to find the light.",
                "I'm feeling like I'm in a deep hole and can't seem to climb out.",
                "I'm feeling like I'm living in a pressure cooker and can't seem to release the steam.",
                "I'm feeling like I'm living in a pressure cooker and can't seem to release the steam.",
                "I'm feeling like I'm constantly fighting an uphill battle and can't seem to gain ground.",
                "I'm feeling like I'm living in a world that's moving too fast for me to keep up.",
                "I'm feeling like I'm in a constant state of chaos and can't seem to find order.",
                "I'm feeling like I'm overwhelmed with everything that's going on in my life.",
                "I'm feeling like I'm carrying the weight of the world on my shoulders and it's crushing me.",
                "I'm feeling like I'm constantly second-guessing myself and can't seem to make decisions.",
                "I'm feeling like I'm suffocating under the weight of my stress and can't seem to breathe.",
                "I'm feeling like I'm constantly running on empty and can't seem to refuel.",
                "I'm feeling like I'm in a never-ending cycle of stress and can't seem to break free.",
                "I'm feeling like I'm living in a nightmare that I can't wake up from.",
                "I'm feeling like I'm constantly on edge and can't seem to relax.",
                "I'm feeling like I'm living in a pressure cooker and can't seem to release the steam.",
                "I'm feeling like I'm drowning in a sea of deadlines and obligations.",
                "I'm feeling like I'm constantly chasing after something that I can never seem to catch.",
                "I'm feeling like I'm stuck in a rut and can't seem to find a way out.",
                "I'm feeling like I'm in a dark place and can't seem to see the light.",
                "I'm feeling like I'm constantly putting out fires and can't seem to prevent new ones from starting.",
                "I'm feeling like I'm living in a world that's moving too fast for me to keep up.",
                "I'm feeling like I'm living in a state of perpetual exhaustion and can't seem to recharge."
            ],
            "responses": [
                "Why Zebras Don't Get Ulcers: An Updated Guide to Stress, Stress Related Diseases, and Coping by Robert M. Sapolsky",
                "The Relaxation Response by Herbert Benson and Miriam Z. Klipper",
                "Full Catastrophe Living: Using the Wisdom of Your Body and Mind to Face Stress, Pain, and Illness by Jon Kabat-Zinn",
                "The Body Keeps the Score: Brain, Mind, and Body in the Healing of Trauma by Bessel van der Kolk"
            ]
        },
        {
            "tag": "worthless",
            "patterns": [
                "I feel so worthless.",
                "No one likes me.",
                "I can't do anything.",
                "I am so useless",
                "Nothing makes sense anymore",
                "I feel like I'm not good enough.",
                "I'm feeling like a failure.",
                "I feel like I'm a burden on everyone.",
                "I'm feeling like I'm not deserving of love or respect.",
                "I feel like I can't do anything right.",
                "I'm feeling like I'm not valuable to anyone.",
                "I'm feeling like I'm not contributing anything meaningful.",
                "I'm feeling like I'm a disappointment to others.",
                "I'm feeling like I'm a waste of space.",
                "I'm feeling like I'm not important.",
                "I feel like I have no value or purpose in life.",
                "I'm convinced that I'm a burden to everyone around me and that they would be better off without me.",
                "I'm constantly telling myself that I'm not good enough or that I don't deserve happiness or success.",
                "I'm struggling to find meaning in anything I do and everything feels pointless.",
                "I'm feeling like a failure and like I can't do anything right.",
                "I'm constantly comparing myself to others and feeling like I don't measure up.",
                "I'm feeling like I don't deserve love or affection from anyone, including myself.",
                "I'm having thoughts of self-harm or suicide because I feel so worthless and hopeless.",
                "I'm feeling like I'm stuck in a cycle of negative self-talk and can't escape it.",
                "I'm avoiding social situations or interactions because I feel like I'm not good enough to be around others.",
                "I feel like everything I do is pointless and that I can't make a difference in the world.",
                "I'm constantly second-guessing myself and my abilities, and it's affecting my self-esteem.",
                "I'm struggling to find any motivation to do anything because I feel like it won't matter in the end.",
                "I'm feeling like I'm not contributing anything meaningful to society or to the people around me.",
                "I'm feeling like I'm a failure in all aspects of my life, including work, relationships, and personal goals.",
                "I'm constantly criticizing myself and my mistakes, and it's making me feel worthless.",
                "I'm feeling like I'm not living up to the expectations of others or society, and it's making me feel inadequate.",
                "I'm experiencing physical symptoms like fatigue, lack of appetite, or insomnia because of my feelings of worthlessness.",
                "I'm feeling like I don't deserve to take care of myself, including eating well, exercising, or practicing self-care.",
                "I'm struggling with a sense of hopelessness and despair, feeling like my life will never improve.",
                "I feel like I'm a burden to others, and that my problems are too insignificant to be worth anyone's time.",
                "I'm constantly comparing myself to others, and feeling like I'm falling short in every way.",
                "I'm feeling like no matter what I do, it's never enough to make a real impact or difference.",
                "I'm struggling with feelings of shame and embarrassment about my perceived shortcomings and failures.",
                "I'm finding it hard to believe that anyone could genuinely care about me, given how little I think I have to offer.",
                "I'm feeling like I'm completely useless and that no one would notice if I disappeared.",
                "I'm struggling to find any sense of purpose or meaning in my life, and it's making me feel worthless.",
                "I'm feeling like a fraud or an imposter, like I'm just pretending to be competent or successful.",
                "I'm experiencing a sense of isolation and loneliness, feeling like I don't belong or that I'm not worthy of connection.",
                "I'm finding it hard to enjoy anything or experience pleasure because I feel like I don't deserve it.",
                "I feel like I'm a failure in every aspect of my life, and that I'll never be good enough.",
                "I'm constantly berating myself for my mistakes and flaws, and it's making me feel like I'm worthless.",
                "I'm struggling with feelings of hopelessness and despair, like there's no point in trying because I'm not worth it.",
                "I feel like everything I do is wrong.",
                "I'm feeling like a failure in my career.",
                "I'm feeling like I'm not good enough to achieve my dreams.",
                "I'm feeling like I'm not making a difference in the world.",
                "I'm feeling like I'm not living up to my potential.",
                "I'm feeling like I'm not smart enough.",
                "I'm feeling like I'm not attractive or desirable.",
                "I'm feeling like I'm not talented or creative.",
                "I'm feeling like I'm not important to anyone.",
                "I'm feeling like I'm not contributing to society.",
                "I'm feeling like I'm not accepted by others.",
                "I'm feeling like I'm not respected or valued by others.",
                "I'm feeling like I'm not loved by anyone.",
                "I'm feeling like I'm not worthy of love or happiness.",
                "I'm feeling like I'm not worthy of success or achievement.",
                "I'm feeling like I'm not worthy of respect or admiration.",
                "I'm feeling like I'm not capable of overcoming challenges.",
                "I'm feeling like I'm not strong enough to handle difficult situations.",
                "I'm feeling like I'm not resilient enough to bounce back from failures.",
                "I'm feeling like I'm not confident in myself or my abilities.",
                "I'm feeling like I'm not capable of making good decisions.",
                "I'm feeling like I'm not capable of forming meaningful relationships.",
                "I'm feeling like I'm not capable of having a fulfilling life.",
                "I'm feeling like I'm not capable of being happy.",
                "I'm feeling like I'm not capable of experiencing joy or pleasure.",
                "I'm feeling like I'm not capable of overcoming my challenges.",
                "I'm feeling like I'm not capable of achieving my goals.",
                "I'm feeling like I'm not capable of making positive changes in my life.",
                "I'm feeling like I'm not capable of overcoming my fears.",
                "I'm feeling like I'm not capable of facing my problems.",
                "I'm feeling like I'm not capable of managing my emotions.",
                "I'm feeling like I'm not capable of dealing with stress.",
                "I'm feeling like I'm not capable of handling conflicts.",
                "I'm feeling like I'm not capable of being assertive.",
                "I'm feeling like I'm not capable of standing up for myself.",
                "I'm feeling like I'm not capable of setting boundaries.",
                "I'm feeling like I'm not capable of expressing my needs and wants.",
                "I'm feeling like I'm not capable of asking for help.",
                "I'm feeling like I'm not capable of accepting help.",
                "I'm feeling like I'm not capable of trusting others.",
                "I'm feeling like I'm not capable of forgiving myself or others.",
                "I'm feeling like I'm not capable of letting go of the past.",
                "I'm feeling like I'm not capable of living in the present.",
                "I'm feeling like I'm not capable of planning for the future.",
                "I'm feeling like I'm not capable of adapting to change.",
                "I'm feeling like I'm not capable of learning from my mistakes.",
                "I'm feeling like I'm not capable of improving myself.",
                "I'm feeling like I'm not capable of achieving inner peace.",
                "I'm feeling like I'm not capable of finding happiness within myself.",
                "I'm feeling like I'm not capable of finding meaning in my life.",
                "I'm feeling like my life has no purpose or direction.",
                "I feel like a failure and a disappointment to myself and others.",
                "I'm constantly belittling myself and my accomplishments.",
                "I feel like I don't have any talents or skills that are valuable to others.",
                "I'm struggling with feelings of inadequacy and inferiority.",
                "I'm feeling like I'm not making a positive difference in the world.",
                "I'm feeling like I'm not deserving of good things that happen to me.",
                "I'm experiencing a sense of emptiness and meaninglessness in my life.",
                "I'm feeling like I'm a burden on my friends and family.",
                "I'm finding it hard to believe in myself and my abilities.",
                "I feel like I'm constantly letting myself and others down.",
                "I'm feeling like I'm not attractive, intelligent, or interesting enough to be liked by others.",
                "I'm struggling with a lack of confidence and self-esteem.",
                "I feel like my life is pointless and that I'll never achieve anything significant.",
                "I'm feeling like I'm not important or valuable to anyone.",
                "I'm experiencing a sense of hopelessness and despair that I can't seem to shake.",
                "I'm feeling like I'm not contributing anything meaningful to society or to the world at large.",
                "I'm finding it hard to see any positives in myself or my life.",
                "I'm feeling like I'm not living up to my own expectations.",
                "I feel like I'm constantly failing at everything I do.",
                "I'm feeling like I'm not worth the effort or time it takes for others to care about me.",
                "I'm struggling with a sense of worthlessness that seems to be getting worse over time.",
                "I'm feeling like I'm not capable of achieving anything that I truly want.",
                "I'm experiencing a sense of guilt and shame that I can't seem to shake.",
                "I'm feeling like I'm not good enough to be loved or respected by others.",
                "I'm finding it hard to be kind to myself or to give myself credit for my accomplishments.",
                "I'm feeling like I'm not deserving of forgiveness or second chances.",
                "I'm struggling with a sense of loneliness and isolation, even when I'm around others.",
                "I feel like I'm constantly failing to meet the expectations of others.",
                "I'm feeling like I'm not worthy of success or happiness.",
                "I'm finding it hard to believe that things will ever get better for me.",
                "I'm feeling like I'm not making a positive impact on the world around me.",
                "I'm struggling with negative thoughts and emotions that I can't seem to control.",
                "I'm feeling like I'm not good enough to be successful in any area of my life.",
                "I'm experiencing a sense of worthlessness that's affecting every aspect of my life.",
                "I'm feeling like I'm a disappointment to everyone around me, and that they would be better off without me.",
                "I'm finding it hard to make decisions or take action because I don't believe in myself or my abilities.",
                "I'm experiencing a sense of powerlessness and helplessness, like I have no control over my life or my future.",
                "I'm feeling like I'm stuck in a rut and that I'll never be able to make any real progress or achieve anything significant.",
                "I'm struggling with negative self-talk and an internal voice that's constantly telling me I'm not good enough.",
                "I'm feeling like I'm a burden on my loved ones and that they would be better off without me.",
                "I'm finding it hard to accept compliments or praise because I don't believe that I deserve it."
            ],
            "responses": [
                "The Gifts of Imperfection: Let Go of Who You Think You're Supposed to Be and Embrace Who You Are by Brené Brown",
                "Feeling Good: The New Mood Therapy by David D. Burns",
                "The Mindful Path to Self-Compassion: Freeing Yourself from Destructive Thoughts and Emotions by Christopher Germer",
                "The Self-Esteem Workbook by Glenn R. Schiraldi"
            ]
        },
        {
            "tag": "depressed",
            "patterns": [
                "I can't take it anymore",
                "I am so depressed",
                "I think i'm depressed.",
                "I have depression",
                "I'm feeling really sad and don't know why.",
                "I'm feeling like I don't have any energy or motivation.",
                "I'm feeling like I can't enjoy anything anymore.",
                "I'm feeling hopeless and like things will never get better.",
                "I'm feeling like nothing matters.",
                "I'm feeling like I'm stuck in a rut.",
                "I'm feeling like I'm a burden on others.",
                "I'm feeling like I just want to stay in bed all day.",
                "I'm feeling like I'm not myself anymore.",
                "I'm feeling like life is just too hard to handle.",
                "I'm feeling sad or down most of the time and it's affecting my daily life.",
                "I'm losing interest in activities or hobbies that I used to enjoy.",
                "I'm feeling tired or fatigued even when I've gotten enough sleep.",
                "I'm experiencing changes in my appetite or weight because of depression.",
                "I'm feeling guilty or worthless even when I haven't done anything wrong.",
                "I'm having trouble concentrating or remembering things because of depression.",
                "I'm feeling like I'm moving or speaking more slowly than usual.",
                "I'm experiencing physical symptoms like headaches or stomach aches because of depression.",
                "I'm feeling hopeless or like things will never get better.",
                "I'm experiencing thoughts of self-harm or suicide because of depression.",
                "I'm having trouble sleeping or sleeping too much because of depression.",
                "I'm feeling like I'm emotionally numb or that nothing brings me pleasure anymore.",
                "I'm experiencing aches or pains that don't have a physical cause because of depression.",
                "I'm withdrawing from social interactions or avoiding activities because of depression.",
                "I'm feeling like I'm a burden to others because of my depression.",
                "I'm feeling like I'm not good enough or that I'm a failure because of depression.",
                "I'm experiencing a loss of interest in sex because of depression.",
                "I'm having trouble making decisions or being productive because of depression.",
                "I'm feeling irritable or easily frustrated because of depression.",
                "I'm experiencing feelings of emptiness or a lack of purpose because of depression.",
                "I'm feeling like I'm stuck in a cycle of negative thoughts and emotions.",
                "I'm feeling like everything is too overwhelming to handle because of depression.",
                "I'm feeling like I'm disconnected from the world or that things don't seem real because of depression.",
                "I'm having trouble finding pleasure in things that used to make me happy because of depression.",
                "I'm experiencing physical symptoms like fatigue or body aches because of depression.",
                "I'm feeling like I'm losing my sense of self because of depression.",
                "I'm feeling like I'm trapped in a dark cloud and I can't see a way out.",
                "I'm feeling like I'm a burden on others or that I'm letting people down because of depression.",
                "I'm experiencing feelings of sadness or hopelessness that don't seem to go away.",
                "I feel like I'm in a deep hole and I can't climb out because of my depression.",
                "I'm feeling hopeless and like nothing will ever get better.",
                "I'm having difficulty concentrating or remembering things because of my depression.",
                "I'm feeling fatigued all the time because of my depression.",
                "I'm experiencing changes in my appetite or weight because of depression.",
                "I'm feeling like I'm not myself and I don't know how to get back to who I was.",
                "I'm feeling like I'm worthless or that I have no value because of my depression.",
                "I'm feeling like I'm a burden on my loved ones because of my depression.",
                "I'm experiencing feelings of guilt or shame because of my depression.",
                "I'm feeling like I'm trapped in a fog of negative thoughts and emotions that I can't escape.",
                "I'm feeling like every task or decision is too much to handle and is draining my energy.",
                "I'm experiencing changes in my sexual desires or abilities that I can't explain or control because of depression.",
                "I'm feeling like I'm disconnected from reality and like I'm observing life from a distance.",
                "I'm struggling to find joy or pleasure in activities or hobbies that used to bring me happiness.",
                "I'm experiencing physical symptoms like fatigue, headaches, or digestive issues that have no clear medical explanation because of depression.",
                "I'm feeling like I'm losing my identity or sense of self, like I'm not sure who I am anymore.",
                "I'm feeling like I'm drowning in sadness and can't escape it.",
                "I'm feeling like everything is too much to handle and I can't cope anymore.",
                "I'm feeling like I'm stuck in a dark hole and can't find a way out.",
                "I'm feeling like my emotions are out of control and I don't know how to handle them.",
                "I'm feeling like I'm constantly on edge and can't relax.",
                "I'm feeling like I'm not good enough and don't deserve happiness.",
                "I'm feeling like I'm living in a constant state of fear and anxiety.",
                "I'm feeling like I'm always tired and can't find the energy to do anything.",
                "I'm feeling like I'm losing my grip on reality and can't tell what's real anymore.",
                "I'm feeling like I'm alone and that nobody understands what I'm going through.",
                "I'm feeling like my life has no purpose and that everything is meaningless.",
                "I'm feeling like I'm stuck in a cycle of negative thoughts and can't break free.",
                "I'm feeling like I'm constantly on the verge of tears and can't stop crying.",
                "I'm feeling like I'm a burden to others and that nobody wants me around.",
                "I'm constantly feeling drained and tired, even after a good night's sleep.",
                "I'm struggling to find meaning or purpose in my life because of my depression.",
                "I feel like I'm stuck in a never-ending cycle of negative thoughts and emotions.",
                "I'm feeling like my depression is consuming my life and I can't escape it.",
                "I'm feeling like I'm a burden on my family and friends because of my depression.",
                "I'm having difficulty connecting with others because of my depression.",
                "I'm feeling like I'm constantly on edge and anxious because of my depression.",
                "I'm experiencing a sense of hopelessness and despair that won't go away.",
                "I'm feeling like I'm losing control of my life because of my depression.",
                "I'm feeling like I'm in a deep, dark hole that I can't climb out of.",
                "I'm struggling to find the motivation to do even the simplest of tasks because of my depression.",
                "I'm feeling like I'm not good enough and that I'll never be able to live up to my own expectations.",
                "I'm experiencing physical symptoms like chest pain or shortness of breath because of my depression.",
                "I'm feeling like my depression is taking away my ability to experience joy or happiness.",
                "I'm struggling to maintain relationships because of my depression.",
                "I'm feeling like I'm not in control of my own thoughts or emotions because of my depression.",
                "I'm feeling like I'm living in a world of darkness and that there's no light at the end of the tunnel.",
                "I'm feeling like I'm constantly being pulled down by my depression and that I'll never be able to break free.",
                "I'm feeling like I'm lost and alone because of my depression.",
                "I'm experiencing feelings of worthlessness and self-doubt because of my depression.",
                "I'm feeling like my depression is holding me back from achieving my goals.",
                "I'm feeling like I'm constantly drowning in my own negative thoughts and emotions.",
                "I'm feeling like I'm constantly being judged and criticized by others.",
                "I'm feeling like I'm trapped in my own mind and can't escape my thoughts.",
                "I'm feeling like I'm living in a nightmare that I can't wake up from.",
                "I'm feeling like I'm constantly overwhelmed by my emotions and can't control them.",
                "I'm feeling like I'm in a dark tunnel with no end in sight.",
                "I'm feeling like I'm always alone even when surrounded by people.",
                "I'm feeling like I'm suffocating and can't catch my breath.",
                "I'm feeling like I'm walking through life in a fog and can't see clearly.",
                "I'm feeling like I'm constantly battling negative thoughts and feelings.",
                "I'm feeling like I'm losing my mind and can't hold on to reality.",
                "I'm feeling like I'm in a pit of despair and can't climb out.",
                "I'm feeling like I'm constantly fighting a losing battle.",
                "I'm feeling like I'm on the edge of a cliff and could fall off at any moment.",
                "I'm feeling like I'm surrounded by darkness and can't find my way out.",
                "I'm feeling like I'm always on the verge of a breakdown and can't hold it together.",
                "I'm feeling like I'm drowning in a sea of sadness and can't swim to the surface.",
                "I'm feeling like I'm stuck in a never-ending cycle of pain and suffering.",
                "I'm feeling like I'm always carrying a heavy weight on my shoulders and can't put it down.",
                "I'm feeling like I'm lost in a maze and can't find my way out.",
                "I'm feeling like I'm constantly battling demons inside my head.",
                "I'm feeling like I'm always one step away from falling apart.",
                "I'm feeling like I'm living in a world that's too cruel and harsh for me.",
                "I'm feeling like I'm slowly losing myself and can't find my way back.",
                "I'm constantly feeling drained and tired, even after a good night's sleep.",
                "I'm struggling to find meaning or purpose in my life because of my depression.",
                "I feel like I'm stuck in a never-ending cycle of negative thoughts and emotions.",
                "I'm feeling like my depression is consuming my life and I can't escape it.",
                "I'm feeling like I'm a burden on my family and friends because of my depression.",
                "I'm having difficulty connecting with others because of my depression.",
                "I'm feeling like I'm constantly on edge and anxious because of my depression.",
                "I'm experiencing a sense of hopelessness and despair that won't go away.",
                "I'm feeling like I'm losing control of my life because of my depression.",
                "I'm feeling like I'm in a deep, dark hole that I can't climb out of.",
                "I'm struggling to find the motivation to do even the simplest of tasks because of my depression.",
                "I'm feeling like I'm not good enough and that I'll never be able to live up to my own expectations.",
                "I'm experiencing physical symptoms like chest pain or shortness of breath because of my depression.",
                "I'm feeling like my depression is taking away my ability to experience joy or happiness.",
                "I'm struggling to maintain relationships because of my depression.",
                "I'm feeling like I'm not in control of my own thoughts or emotions because of my depression.",
                "I'm feeling like I'm living in a world of darkness and that there's no light at the end of the tunnel.",
                "I'm feeling like I'm constantly being pulled down by my depression and that I'll never be able to break free.",
                "I'm feeling like I'm lost and alone because of my depression.",
                "I'm experiencing feelings of worthlessness and self-doubt because of my depression.",
                "I'm feeling like my depression is holding me back from achieving my goals.",
                "I'm feeling like I'm constantly drowning in my own negative thoughts and emotions.",
                "I feel like I'm stuck in a dark hole.",
                "I'm feeling emotionally drained and overwhelmed.",
                "I can't seem to find any joy or happiness in anything anymore.",
                "I feel like a burden to those around me.",
                "I'm having trouble sleeping and waking up feeling exhausted.",
                "I feel like I'm constantly fighting a battle within myself.",
                "I'm struggling to find any motivation to do anything.",
                "I feel like I'm trapped in my own mind.",
                "I feel like I'm drowning in my own thoughts and emotions.",
                "I'm feeling empty and numb inside.",
                "I feel like I'm losing control over my life.",
                "I'm finding it hard to connect with others and build meaningful relationships.",
                "I feel like I'm on an emotional rollercoaster.",
                "I feel like I'm walking around in a fog.",
                "I'm finding it hard to focus and concentrate.",
                "I'm feeling hopeless and like there's no way out.",
                "I feel like I'm at the bottom of a deep hole with no way to climb out.",
                "I feel like I'm just going through the motions and not really living.",
                "I feel like I'm a burden to my loved ones and that they would be better off without me.",
                "I'm feeling like I'm in a constant state of sadness.",
                "I feel like I'm suffocating under the weight of my own thoughts and feelings.",
                "I'm struggling to find meaning and purpose in my life.",
                "I feel like I'm stuck in a never-ending cycle of despair.",
                "I feel like I'm in a constant state of emotional pain.",
                "I feel like I'm losing my grip on reality.",
                "I'm feeling like I'm constantly at war with my own mind.",
                "I feel like I'm standing on the edge of a cliff, ready to fall off at any moment.",
                "I feel like I'm living in a world of darkness and shadows.",
                "I'm struggling to find a reason to keep going.",
                "I feel like I'm in a constant state of emotional turmoil.",
                "I feel like I'm lost in a maze and can't find my way out.",
                "I'm feeling like I'm running on empty and have nothing left to give.",
                "I feel like I'm trapped in a never-ending nightmare.",
                "I feel like I'm in a deep, dark hole with no way out.",
                "I'm feeling like I'm living in a world of gray, with no color or light.",
                "I feel like I'm suffocating under the weight of my own emotions.",
                "I'm feeling like I'm in a never-ending storm that's tearing me apart.",
                "I feel like I'm walking through a minefield, never knowing when the next explosion will happen.",
                "I feel like I'm carrying a heavy weight on my shoulders that I can't put down.",
                "I'm feeling like I'm constantly battling my own demons.",
                "I feel like I'm on a never-ending rollercoaster of emotions.",
                "I'm struggling to find any sense of purpose or direction in my life.",
                "I feel like I'm in a constant state of emotional chaos.",
                "I feel like I'm stuck in quicksand, sinking deeper and deeper with every passing day.",
                "I'm feeling like I'm lost in a never-ending maze with no exit.",
                "I'm feeling like I'm trapped in a cage and can't break free.",
                "I'm feeling like I'm always being pulled down by a heavy anchor that I can't escape.",
                "I'm feeling like I'm trapped in a never-ending cycle of sadness and hopelessness, and that things will never get better.",
                "I'm feeling like I'm a burden on my loved ones or like I'm letting them down because of my depression.",
                "I'm feeling overwhelmed by feelings of sadness or despair that feel like they will never go away."
            ],
            "responses": [
                "Feeling Good: The New Mood Therapy by David D. Burns",
                "The Noonday Demon: An Atlas of Depression by Andrew Solomon",
                "Lost Connections: Uncovering the Real Causes of Depression - and the Unexpected Solutions by Johann Hari",
                "The Mindful Way through Depression: Freeing Yourself from Chronic Unhappiness by Mark Williams, John Teasdale, Zindel Segal, and Jon Kabat-Zinn"
            ]
        },
        {
            "tag": "anxious",
            "patterns": [
                "I feel so anxious.",
                "I'm so anxious because of ",
                "I'm feeling really anxious right now and don't know how to calm down.",
                "I'm feeling really nervous and jittery.",
                "I'm feeling like something bad is going to happen.",
                "I'm feeling like I'm in danger, even though I know I'm not.",
                "I'm feeling like I can't breathe properly.",
                "I'm feeling like I'm losing control.",
                "I'm feeling like I'm going to have a panic attack.",
                "I'm feeling like my thoughts are racing and I can't slow them down.",
                "I'm feeling like I'm constantly on edge and can't relax.",
                "I'm feeling like I'm trapped and can't escape.",
                "I'm feeling really worried and on edge, even though there's no specific reason to be.",
                "I'm experiencing physical symptoms like a racing heart, sweating, or trembling when I feel anxious.",
                "I'm avoiding certain situations or activities because they make me feel anxious or uncomfortable.",
                "I'm constantly thinking about worst-case scenarios or things that could go wrong, which is making me feel anxious.",
                "I'm struggling with social anxiety or fear of being judged or rejected by others.",
                "I'm feeling like I'm not in control of my thoughts or my emotions, which is causing me to feel anxious and overwhelmed.",
                "I'm experiencing a lot of negative self-talk or self-doubt, which is making me feel anxious about my abilities or worth.",
                "I'm having trouble sleeping or staying asleep because of anxiety.",
                "I'm feeling like I'm in danger or that something bad is going to happen, even though there's no real threat.",
                "I'm feeling anxious about an upcoming event or situation, like a job interview or a social gathering.",
                "I'm experiencing panic attacks or sudden feelings of intense fear or dread.",
                "I'm feeling like I can't catch my breath or like I'm suffocating when I'm anxious.",
                "I'm feeling like I'm going to faint or pass out when I'm anxious.",
                "I'm having trouble concentrating or focusing on tasks because of anxiety.",
                "I'm feeling like I'm constantly on high alert or like I can't relax because of anxiety.",
                "I'm experiencing physical symptoms like stomach aches or headaches because of anxiety.",
                "I'm feeling like I'm constantly worrying about things that are outside of my control.",
                "I'm having trouble managing my anxiety on my own and I'm considering seeking professional help.",
                "I'm feeling like my anxiety is affecting my relationships with others or my ability to function in daily life.",
                "I'm experiencing intrusive thoughts or images that are causing me to feel anxious.",
                "I'm feeling like I'm constantly worrying about the future and what might happen.",
                "I'm feeling like I'm always second-guessing myself and my decisions.",
                "I'm experiencing feelings of restlessness or agitation because of anxiety.",
                "I'm feeling like I'm constantly seeking reassurance or validation from others because of anxiety.",
                "I'm experiencing feelings of guilt or shame because of anxiety.",
                "I'm feeling like I'm stuck in a cycle of negative thoughts and emotions that are hard to break out of.",
                "I'm feeling like I'm losing control of my thoughts and emotions when I'm anxious.",
                "I'm experiencing feelings of fear or dread that seem to come out of nowhere.",
                "I'm feeling like I'm constantly anticipating the worst-case scenario in any situation.",
                "I feel so depressed.",
                "I'm so down because of ",
                "I'm feeling really sad right now and don't know how to shake it off.",
                "I'm feeling really hopeless and helpless.",
                "I'm feeling like there's no point in anything.",
                "I'm feeling like I'm in a dark hole and can't get out.",
                "I'm feeling like I can't enjoy anything anymore.",
                "I'm feeling like I'm a burden to others.",
                "I'm feeling like I'm not good enough and never will be.",
                "I'm feeling like I'm stuck in this state and can't escape.",
                "I'm feeling like I'm losing interest in things that used to matter to me.",
                "I'm feeling like I'm constantly tired and have no energy.",
                "I'm feeling like I'm worthless and don't deserve anything good.",
                "I'm experiencing physical symptoms like aches, pains, or fatigue when I feel depressed.",
                "I'm avoiding social situations or activities because they don't bring me joy or I don't have the energy.",
                "I'm constantly thinking about negative thoughts and feelings, which is making me feel even more depressed.",
                "I'm struggling with self-esteem or feeling like I'm not worth anything.",
                "I'm feeling like I'm not in control of my thoughts or my emotions, which is causing me to feel depressed and overwhelmed.",
                "I'm experiencing trouble sleeping or sleeping too much because of depression.",
                "I'm feeling like I'm a burden to others and that they would be better off without me.",
                "I'm feeling depressed about my job, my relationships, or my life in general.",
                "I'm experiencing mood swings or sudden changes in my emotions.",
                "I'm feeling like I'm losing interest in sex or intimacy.",
                "I'm feeling like I can't concentrate or focus on tasks because of depression.",
                "I'm feeling like I'm constantly sad or empty, even when good things happen.",
                "I'm experiencing physical symptoms like changes in appetite or weight because of depression.",
                "I'm feeling like I'm constantly overwhelmed and can't cope with everyday tasks.",
                "I'm having trouble finding joy in things that used to make me happy.",
                "I'm feeling like I'm constantly in a bad mood or irritable because of depression.",
                "I'm experiencing feelings of guilt or worthlessness because of depression.",
                "I'm feeling like I'm stuck in a cycle of negative thoughts and emotions that are hard to break out of.",
                "I'm feeling like I'm losing interest in things that used to bring me joy.",
                "I'm experiencing feelings of hopelessness or despair about the future.",
                "I'm feeling like I'm constantly questioning my decisions and second-guessing myself.",
                "I'm experiencing feelings of loneliness or isolation because of depression.",
                "I'm feeling like I'm constantly seeking reassurance or validation from others because of depression.",
                "I'm experiencing feelings of anger or irritability that seem to come out of nowhere.",
                "I'm feeling like I'm constantly apologizing for everything and taking responsibility for things that aren't my fault.",
                "I'm experiencing feelings of worthlessness or self-doubt that are affecting my relationships and daily life.",
                "I'm feeling like I'm losing interest in my hobbies or things I used to enjoy.",
                "I'm experiencing feelings of sadness or despair that seem to come out of nowhere.",
                "I'm feeling like I'm constantly comparing myself to others and coming up short.",
                "I'm experiencing feelings of apathy or numbness about life.",
                "I'm feeling like I'm drowning in anxiety.",
                "I'm feeling like I'm trapped in my own mind.",
                "I'm feeling like I'm suffocating under the weight of my anxiety.",
                "I'm feeling like I'm constantly living in a state of fear and dread.",
                "I'm feeling like my anxiety is taking over my life.",
                "I'm experiencing physical symptoms like dizziness, nausea, or chest pain because of anxiety.",
                "I'm feeling like I'm constantly checking and rechecking things because of anxiety.",
                "I'm experiencing flashbacks or nightmares related to past traumatic events.",
                "I'm feeling like I'm constantly doubting myself and my abilities because of anxiety.",
                "I'm feeling like I'm constantly trying to avoid anything that might trigger my anxiety.",
                "I'm experiencing a sense of impending doom or danger that I can't shake off.",
                "I'm feeling like my anxiety is making it difficult for me to make decisions or take action.",
                "I'm feeling like my anxiety is causing me to miss out on important opportunities.",
                "I'm experiencing feelings of loneliness or isolation because of anxiety.",
                "I'm feeling like I'm constantly in fight-or-flight mode because of anxiety.",
                "I'm feeling like I'm losing my grip on reality when I'm anxious.",
                "I'm experiencing feelings of hopelessness or despair because of anxiety.",
                "I'm feeling like my anxiety is making it hard for me to enjoy things that I used to love.",
                "I'm feeling like I'm constantly worrying about the past or the future, and can't focus on the present.",
                "I'm feeling like I'm constantly holding my breath when I'm anxious.",
                "I'm experiencing feelings of irritability or anger because of anxiety.",
                "I'm feeling like my anxiety is making it hard for me to connect with others or form relationships.",
                "I'm feeling like my anxiety is causing me to engage in unhealthy behaviors, like substance abuse or overeating.",
                "I'm experiencing feelings of guilt or shame because of things I've done or said while anxious.",
                "I'm feeling like I'm constantly on the verge of tears when I'm anxious.",
                "I'm experiencing feelings of emptiness or numbness because of anxiety.",
                "I'm feeling like my anxiety is a burden to others, and that I should just keep it to myself.",
                "I'm feeling like my anxiety is never going to go away or get better.",
                "I'm experiencing feelings of self-doubt or self-hatred because of my anxiety.",
                "I'm feeling like I'm constantly stuck in a cycle of anxiety that I can't break out of.",
                "I'm feeling like my anxiety is a constant companion that I can't escape from.",
                "I'm experiencing feelings of panic or terror that are completely overwhelming.",
                "I'm feeling like I'm constantly on the edge of a breakdown because of my anxiety.",
                "I'm feeling like my anxiety is a part of me that I can't separate from.",
                "I'm experiencing feelings of loneliness or isolation even when I'm around others.",
                "I'm feeling like my anxiety is causing me to lose touch with reality.",
                "I'm feeling like my anxiety is making it hard for me to be productive or accomplish things.",
                "I'm experiencing feelings of helplessness or powerlessness because of my anxiety.",
                "I'm feeling like I'm constantly running away from something when I'm anxious.",
                "I'm feeling like my anxiety is a monster that's always lurking in the shadows, waiting to pounce.",
                "I'm experiencing feelings of anxiety that are affecting my appetite or causing me to lose weight."
            ],
            "responses": [
                "Feeling Good: The New Mood Therapy by David D. Burns",
                "The Anxiety and Phobia Workbook by Edmund J. Bourne",
                "The Worry Cure: Seven Steps to Stop Worry from Stopping You by Robert L. Leahy",
                "The Mindfulness and Acceptance Workbook for Anxiety: A Guide to Breaking Free from Anxiety, Phobias, and Worry Using Acceptance and Commitment Therapy by John P. Forsyth and Georg H. Eifert"
            ]
        },
        {
            "tag": "sleep",
            "patterns": [
                "I have insominia",
                "I am suffering from insomnia",
                "I can't sleep.",
                "I haven't slept for the last days.",
                "I can't seem to go to sleep.",
                "I haven't had proper sleep for the past few days.",
                "I'm having trouble falling asleep at night, even though I feel tired.",
                "I'm waking up frequently during the night and having trouble getting back to sleep.",
                "I'm waking up too early in the morning and having trouble getting back to sleep.",
                "I'm experiencing vivid or disturbing dreams that are interfering with my sleep.",
                "I'm feeling exhausted during the day, even though I'm getting enough sleep at night.",
                "I'm finding it difficult to stay asleep for more than a few hours at a time.",
                "I'm feeling restless or agitated when I try to sleep.",
                "I'm experiencing sleep paralysis or other types of sleep disturbances.",
                "I'm using sleep aids or medications to try to help me sleep, but they aren't working well.",
                "I'm having trouble sleeping due to stress, anxiety, or other emotional issues.",
                "I feel tired all the time, even after a full night's sleep.",
                "I've been snoring loudly and waking up feeling tired.",
                "I'm feeling drowsy during the day and struggling to stay awake.",
                "I'm having nightmares that are affecting my sleep quality.",
                "I'm experiencing sleepwalking or other unusual sleep behaviors.",
                "I'm struggling to adjust to a new sleep schedule, such as working night shifts.",
                "I'm experiencing jet lag and having trouble sleeping in a new time zone.",
                "I'm feeling more irritable or moody than usual due to lack of sleep.",
                "I'm experiencing physical symptoms such as headaches or muscle pain due to lack of sleep.",
                "I'm feeling anxious or depressed, which is making it difficult for me to fall asleep.",
                "I'm having trouble sleeping due to chronic pain or medical conditions.",
                "I'm finding it difficult to sleep due to chronic pain or discomfort.",
                "I'm experiencing an increase in blood pressure or heart disease risk due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's or roommate's use of electronic devices in bed.",
                "I'm experiencing an increase in forgetfulness or memory problems due to lack of sleep.",
                "I'm finding it difficult to stay awake or focused during long periods of sitting or inactivity.",
                "I'm experiencing a decrease in overall physical health or immune system function due to lack of sleep.",
                "I'm having trouble sleeping because of a fear of the dark or sleeping alone.",
                "I'm experiencing an increase in accidents or injuries due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of a fear of missing out on social or work opportunities.",
                "I'm experiencing a decrease in decision-making ability or judgment due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's or roommate's different sleep schedule or routine.",
                "I'm experiencing an increase in inflammation or chronic disease symptoms due to lack of sleep.",
                "I'm finding it difficult to stay awake or focused during leisure activities or hobbies.",
                "I'm experiencing a decrease in quality of life or overall happiness due to lack of sleep.",
                "I'm having trouble sleeping because of a fear of being unable to wake up in time for work or school.",
                "I'm experiencing an increase in accidents or mistakes at work or school due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of a noisy or uncomfortable sleeping environment.",
                "I'm experiencing a decrease in ability to handle change or adapt to new situations due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's or roommate's different sleeping positions or movements.",
                "I'm experiencing an increase in risk of developing mental health disorders like depression or anxiety due to lack of sleep.",
                "I'm finding it difficult to stay awake or focused during important conversations or meetings.",
                "I'm experiencing a decrease in ability to perform well on exams or other assessments due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's or roommate's different noise level preferences.",
                "I'm experiencing an increase in risk of developing chronic pain conditions like fibromyalgia due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of a fear of not being able to sleep at all.",
                "I'm experiencing a decrease in ability to multitask or handle multiple responsibilities due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's or roommate's different sleep hygiene habits.",
                "I'm experiencing an increase in risk of developing metabolic disorders like diabetes or obesity due to lack of sleep.",
                "I'm finding it difficult to stay awake or focused during important tasks like driving or operating machinery.",
                "I'm experiencing a decrease in ability to regulate emotions or handle stress due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's or roommate's different bedtimes or wake-up times.",
                "I'm experiencing an increase in risk of developing neurological disorders like Alzheimer's or dementia due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of a noisy or busy city or urban environment.",
                "I'm experiencing a decrease in ability to handle physical pain or discomfort due to lack of sleep.",
                "I'm experiencing an increase in risk of developing cardiovascular disease or stroke due to lack of sleep.",
                "I'm finding it difficult to stay awake or focused during exercise or physical activity.",
                "I'm experiencing a decrease in creativity or problem-solving ability due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's or roommate's different snoring habits.",
                "I'm experiencing an increase in risk of developing cancer or other serious illnesses due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of jet lag or changes in my sleep schedule.",
                "I'm experiencing a decrease in ability to form new memories or learn new information due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's or roommate's different sleep positions or preferences for bed temperature.",
                "I'm experiencing an increase in risk of developing mood disorders like bipolar disorder or schizophrenia due to lack of sleep.",
                "I'm finding it difficult to stay awake or focused during social activities or events.",
                "I'm experiencing a decrease in ability to handle social or emotional situations due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's or roommate's different habits for using the bathroom or getting up during the night.",
                "I'm experiencing an increase in risk of developing neurological disorders like Parkinson's disease or multiple sclerosis due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of anxiety or worry about the future.",
                "I'm experiencing a decrease in ability to engage in meaningful conversations or connections with others due to lack of sleep.",
                "I'm experiencing hot flashes or night sweats that are disrupting my sleep.",
                "I'm having trouble falling asleep because my mind is racing with thoughts.",
                "I'm feeling disoriented or confused when I wake up in the middle of the night.",
                "I'm experiencing a change in appetite or weight due to lack of sleep.",
                "I'm experiencing a decrease in sex drive due to lack of sleep.",
                "I'm having trouble sleeping because of noise or light disturbances.",
                "I'm feeling more forgetful or absent-minded due to lack of sleep.",
                "I'm experiencing a decrease in productivity or work performance due to lack of sleep.",
                "I'm finding it difficult to make decisions or think clearly due to lack of sleep.",
                "I'm experiencing an increase in accidents or near-misses due to lack of sleep.",
                "I'm having trouble falling asleep because of racing thoughts about the future.",
                "I'm experiencing changes in my mood, such as feeling more irritable or emotional, due to lack of sleep.",
                "I'm finding it difficult to fall asleep due to physical discomfort, such as a sore back or neck.",
                "I'm experiencing restless leg syndrome or other physical sensations that are keeping me awake.",
                "I'm having trouble sleeping because of a partner's snoring or movements in bed.",
                "I'm experiencing a decrease in creativity or inspiration due to lack of sleep.",
                "I'm finding it difficult to stay awake or alert during important meetings or events.",
                "I'm experiencing a decrease in social interaction or relationships due to lack of sleep.",
                "I'm having trouble falling asleep because I'm worried about something specific.",
                "I'm experiencing a decrease in overall quality of life due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of caffeine or other stimulants.",
                "I'm having trouble sleeping because of an uncomfortable temperature in the bedroom.",
                "I'm experiencing an increase in heart rate or palpitations due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of a partner's or pet's movements in bed.",
                "I'm experiencing an increase in acne or skin issues due to lack of sleep.",
                "I'm having trouble sleeping because of jet lag or changing time zones.",
                "I'm experiencing a decrease in overall life satisfaction due to lack of sleep.",
                "I'm finding it difficult to stay awake or focused during class or work meetings.",
                "I'm experiencing an increase in depression or feelings of hopelessness due to lack of sleep.",
                "I'm having trouble sleeping because of a lack of routine or consistent sleep schedule.",
                "I'm experiencing an increase in weight gain or difficulty losing weight due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of a racing heart or nervous system activation.",
                "I'm experiencing a decrease in libido or sexual desire due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's restless leg syndrome or other sleep disorder.",
                "I'm experiencing an increase in eye strain or headaches due to lack of sleep.",
                "I'm finding it difficult to stay awake or focused during long drives or commutes.",
                "I'm experiencing a decrease in self-esteem or confidence due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's or roommate's noisy habits or sleep schedule.",
                "I'm experiencing an increase in anxiety or panic attacks due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of a fear of nightmares or night terrors.",
                "I'm experiencing a decrease in motivation or drive to accomplish tasks due to lack of sleep.",
                "I'm having trouble sleeping because of a chronic illness or disease.",
                "I'm experiencing an increase in allergies or asthma symptoms due to lack of sleep.",
                "I'm finding it difficult to stay awake or alert during physical activity or exercise.",
                "I'm experiencing a decrease in ability to cope with stress or difficult situations due to lack of sleep.",
                "I'm having trouble sleeping because of a fear of sleepwalking or sleep talking.",
                "I'm experiencing an increase in cravings for sugary or high-fat foods due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of a noisy or busy household or neighborhood.",
                "I'm experiencing a decrease in creativity or artistic expression due to lack of sleep.",
                "I'm having trouble sleeping because of an uncomfortable or unsupportive pillow.",
                "I'm experiencing an increase in digestive issues or gastrointestinal problems due to lack of sleep.",
                "I'm finding it difficult to stay awake or focused during social interactions or outings.",
                "I'm experiencing a decrease in the ability to connect with others or form meaningful relationships due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's or roommate's sleep apnea or snoring.",
                "I'm experiencing an increase in impulsivity or risky behavior due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of an overactive mind or racing thoughts about the past.",
                "I'm experiencing a decrease in ability to learn or retain new information due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's or roommate's different sleep preferences or habits.",
                "I'm experiencing a decrease in immune function or overall health due to lack of sleep.",
                "I'm having trouble sleeping because of uncomfortable or restrictive sleepwear.",
                "I'm experiencing an increase in cravings for unhealthy foods due to lack of sleep.",
                "I'm finding it difficult to stay awake while driving or operating heavy machinery.",
                "I'm experiencing an increase in the frequency or severity of headaches due to lack of sleep.",
                "I'm having trouble sleeping because of a noisy or uncomfortable sleeping environment.",
                "I'm experiencing an increase in negative thoughts or feelings due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of a partner's snoring or sleep apnea.",
                "I'm experiencing a decrease in athletic performance or physical abilities due to lack of sleep.",
                "I'm having trouble sleeping because of an uncomfortable mattress or pillow.",
                "I'm experiencing an increase in anxiety or worry due to lack of sleep.",
                "I'm finding it difficult to stay awake or alert during important conversations or social events.",
                "I'm experiencing a decrease in cognitive function or memory retention due to lack of sleep.",
                "I'm having trouble sleeping because of a partner's different sleep schedule or habits.",
                "I'm experiencing an increase in feelings of loneliness or isolation due to lack of sleep.",
                "I'm finding it difficult to fall asleep because of a noisy or busy mind.",
                "I'm finding it difficult to focus or concentrate due to lack of sleep."
            ],
            "responses": [
                "Why We Sleep: Unlocking the Power of Sleep and Dreams by Matthew Walker",
                "The Sleep Revolution: Transforming Your Life, One Night at a Time by Arianna Huffington",
                "The Power of When: Discover Your Chronotype--and the Best Time to Eat Lunch, Ask for a Raise, Have Sex, Write a Novel, Take Your Meds, and More by Michael Breus",
                "Sleep Smarter: 21 Essential Strategies to Sleep Your Way to a Better Body, Better Health, and Bigger Success by Shawn Stevenson"
            ]
        },
        {
            "tag": "scared",
            "patterns": [
                "I'm scared",
                "That sounds awful. What do i do?",
                "No i don't want to feel this way",
                "I am scared for myself",
                "I'm feeling really scared right now and don't know what to do.",
                "I'm feeling like I'm in danger.",
                "I'm feeling like something bad is going to happen.",
                "I'm feeling like I'm not safe.",
                "I'm feeling like I'm being watched or followed.",
                "I'm feeling like my heart is racing and I can't catch my breath.",
                "I'm feeling like I'm in a nightmare that I can't wake up from.",
                "I'm feeling like I'm going to die.",
                "I'm feeling like I'm paralyzed and can't move.",
                "I'm feeling like I'm not in control of the situation.",
                "I'm feeling really anxious and afraid about an upcoming event or situation.",
                "I'm experiencing a lot of uncertainty and fear about the future.",
                "I'm feeling like I'm in danger and that something bad is going to happen.",
                "I'm struggling with a phobia or intense fear of something specific.",
                "I'm feeling really vulnerable and exposed, which is causing me to feel scared.",
                "I'm experiencing a lot of stress or pressure in my personal or professional life, which is making me feel scared.",
                "I'm feeling like I don't have any control over my life or my circumstances, which is causing me to feel scared.",
                "I'm struggling with the after-effects of a traumatic event, which is causing me to feel scared and on-edge.",
                "I'm feeling like I'm not safe in my own environment, which is causing me to feel scared.",
                "I'm experiencing a lot of change or uncertainty in my life, which is causing me to feel scared and overwhelmed.",
                "I'm feeling like something bad is going to happen, even though there's no rational reason for it.",
                "I'm experiencing a lot of stress or pressure related to a personal relationship, which is causing me to feel scared and uncertain.",
                "I'm feeling like I'm being watched or monitored, which is causing me to feel scared and paranoid.",
                "I'm struggling with a chronic illness or medical condition, which is causing me to feel scared and vulnerable.",
                "I'm feeling like I'm not in control of my own thoughts or actions, which is causing me to feel scared and helpless.",
                "I'm experiencing a lot of financial stress or hardship, which is causing me to feel scared about my future.",
                "I'm feeling like I'm not good enough or capable enough to handle my responsibilities, which is causing me to feel scared and insecure.",
                "I'm struggling with a history of trauma or abuse, which is causing me to feel scared and unsafe in certain situations.",
                "I'm feeling like I'm in over my head and don't know how to handle a situation, which is causing me to feel scared and overwhelmed.",
                "I'm experiencing a lot of guilt or shame about something I've done, which is causing me to feel scared of the consequences.",
                "I'm feeling like I'm not safe or secure in my own home, which is causing me to feel scared and anxious.",
                "I'm experiencing a lot of self-doubt and negative self-talk, which is causing me to feel scared and uncertain about my abilities.",
                "I'm feeling like I'm not in control of my own life or my future, which is causing me to feel scared and helpless.",
                "I'm struggling with social anxiety or fear of being judged or rejected by others, which is causing me to feel scared and avoidant.",
                "I'm feeling like I'm constantly on edge or in a state of hyperarousal, which is causing me to feel scared and jumpy.",
                "I'm experiencing a lot of physical symptoms such as sweating, shaking, or racing heart, which is causing me to feel scared and overwhelmed.",
                "I'm feeling like I'm being threatened or bullied, which is causing me to feel scared and defensive.",
                "I'm struggling with a fear of failure or a fear of not living up to expectations, which is causing me to feel scared and stressed.",
                "I'm feeling like I'm not able to trust others or form close relationships, which is causing me to feel scared and lonely.",
                "I'm feeling like I'm trapped and can't escape.",
                "I'm feeling like I'm going crazy.",
                "I'm feeling like I'm going to lose control.",
                "I'm feeling like I'm suffocating.",
                "I'm feeling like my mind is racing and I can't slow it down.",
                "I'm feeling like I'm alone and no one can help me.",
                "I'm feeling like I'm losing my mind.",
                "I'm feeling like I'm going to be judged or criticized.",
                "I'm feeling like I'm drowning and can't get to the surface.",
                "I'm feeling like I'm in a nightmare that I can't escape from.",
                "I'm feeling like I'm being threatened or harassed.",
                "I'm scared to make a decision.",
                "I'm feeling like I'm being suffocated by my fear.",
                "I'm feeling like I'm walking on eggshells all the time.",
                "I'm feeling like I'm constantly on the verge of a panic attack.",
                "I'm feeling like I'm being smothered by my fears.",
                "I'm feeling like I'm living in a constant state of dread.",
                "I'm feeling like my life is spiraling out of control.",
                "I'm feeling like I'm stuck in a nightmare that I can't wake up from.",
                "I'm feeling like I'm always looking over my shoulder.",
                "I'm feeling like I'm being held hostage by my own thoughts.",
                "I'm feeling like I'm trapped in a cycle of fear and anxiety.",
                "I'm feeling like I'm drowning in my own emotions.",
                "I'm feeling like I'm losing my grip on reality.",
                "I'm feeling like I'm being swallowed up by my own insecurities.",
                "I'm feeling like I'm constantly in a fight or flight mode.",
                "I'm feeling like I'm never going to be able to escape my fears.",
                "I'm feeling like I'm in a constant battle with myself.",
                "I'm feeling like I'm paralyzed by my own fears.",
                "I'm feeling like I'm always waiting for the other shoe to drop.",
                "I'm feeling like I'm constantly bombarded by negative thoughts.",
                "I'm feeling like I'm suffocating under the weight of my own fears.",
                "I'm feeling like I'm always one step away from disaster.",
                "I'm feeling like I'm in a dark hole and can't see the light.",
                "I'm feeling like I'm losing my mind and there's nothing I can do about it.",
                "I'm feeling like I'm being consumed by my own anxiety.",
                "I'm feeling like I'm being suffocated by my own worries.",
                "I'm feeling like I'm living in a world of constant danger.",
                "I'm feeling like I'm not strong enough to handle my fears.",
                "I'm feeling like I'm always looking for an escape.",
                "I'm feeling like I'm constantly second-guessing myself.",
                "I'm feeling like I'm being buried alive by my own anxiety.",
                "I'm feeling like I'm in a freefall with no safety net.",
                "I'm feeling like I'm being dragged down by my own negativity.",
                "I'm feeling like I'm always waiting for the other shoe to drop.",
                "I'm feeling like I'm being chased by my own fears.",
                "I'm feeling like I'm lost in a maze of my own thoughts.",
                "I'm feeling like I'm in a constant state of panic.",
                "I'm feeling like I'm being suffocated by my own self-doubt.",
                "I'm feeling like I'm in a race against time and I'm losing.",
                "I'm feeling like I'm constantly battling my own demons.",
                "I'm feeling like I'm living in a constant state of fear and uncertainty.",
                "I'm feeling like I'm being held captive by my own anxiety.",
                "I'm feeling like I'm always on the edge of a breakdown.",
                "I'm feeling like I'm being swallowed up by my own fears and doubts.",
                "I'm feeling like I'm living in a nightmare that I can't escape from.",
                "I'm feeling like I'm being crushed by the weight of my own worries.",
                "I'm feeling like I'm living in a world of constant threat and danger.",
                "I'm feeling like I'm walking on eggshells around someone, and it's making me really scared.",
                "I'm feeling like I'm running out of time to accomplish my goals, and it's causing me to feel scared and hopeless.",
                "I'm feeling like I'm not safe online, and it's causing me to feel scared and exposed.",
                "I'm feeling like I'm not sure who I can trust, and it's causing me to feel scared and paranoid.",
                "I'm feeling like I'm not capable of handling a situation, and it's causing me to feel scared and helpless.",
                "I'm feeling like I'm losing my grip on reality, and it's causing me to feel scared and confused.",
                "I'm feeling like I'm not prepared for the future, and it's causing me to feel scared and anxious.",
                "I'm feeling like I'm not sure what my purpose is in life, and it's causing me to feel scared and lost.",
                "I'm feeling like I'm not living up to my own expectations, and it's causing me to feel scared and disappointed in myself.",
                "I'm feeling like I'm not sure how to cope with a difficult situation, and it's causing me to feel scared and overwhelmed.",
                "I'm feeling like my fear is taking over my life.",
                "I'm feeling like I'm not strong enough to face my fears.",
                "I'm scared of the dark.",
                "I'm scared of heights.",
                "I'm scared of spiders.",
                "I'm scared of public speaking.",
                "I'm scared of failure.",
                "I'm scared of getting hurt.",
                "I'm feeling like I'm in a constant state of fear and can't escape.",
                "I'm feeling like my fear is irrational, but I can't shake it.",
                "I'm feeling like I'm alone in my fear and no one understands.",
                "I'm scared of the unknown.",
                "I'm scared of change.",
                "I'm feeling like I'm stuck in a cycle of fear and can't break free.",
                "I'm feeling like my fear is holding me back from living my life.",
                "I'm feeling like my fear is causing me to miss out on opportunities.",
                "I'm feeling like my fear is getting worse and I don't know how to stop it.",
                "I'm scared to trust others.",
                "I'm scared of being vulnerable.",
                "I'm feeling like I'm not safe in my own body.",
                "I'm scared of being alone.",
                "I'm scared of the future.",
                "I'm feeling like my fear is causing me physical pain.",
                "I'm feeling like my fear is making me sick.",
                "I'm feeling like I'm not in control of my own thoughts and emotions.",
                "I'm scared of losing someone I love.",
                "I'm scared of being judged by others.",
                "I'm scared of being rejected.",
                "I'm scared of making a mistake.",
                "I'm scared of being embarrassed.",
                "I'm scared of being vulnerable with others.",
                "I'm feeling like my fear is causing me to isolate myself.",
                "I'm feeling like I'm not strong enough to face my fears on my own.",
                "I'm scared of the dark because I can't see what's around me.",
                "I'm scared of heights because I'm afraid of falling.",
                "I'm scared of spiders because they look scary and unpredictable.",
                "I'm scared of public speaking because I'm afraid of being judged.",
                "I'm scared of failure because I'm afraid of disappointing others.",
                "I'm scared of getting hurt because I'm afraid of being vulnerable.",
                "I'm feeling like my fear is causing me to miss out on life experiences.",
                "I'm feeling like my fear is getting in the way of my relationships.",
                "I'm feeling like my fear is causing me to self-sabotage.",
                "I'm scared of the dark because of the unknown.",
                "I'm scared of heights because of the potential danger.",
                "I'm scared of spiders because of their unpredictability.",
                "I'm scared of public speaking because of the potential for failure.",
                "I'm scared of failure because of the potential consequences.",
                "I'm scared of getting hurt because of the potential pain.",
                "I'm feeling like I'm losing touch with reality.",
                "I'm experiencing a lot of flashbacks or intrusive thoughts related to a past traumatic event, which is causing me to feel scared and triggered."
            ],
            "responses": [
                "The Gift of Fear: And Other Survival Signals That Protect Us from Violence by Gavin de Becker",
                "Feel the Fear and Do It Anyway by Susan Jeffers",
                "The Anxiety Survival Guide for Teens: CBT Skills to Overcome Fear, Worry, and Panic by Jennifer Shannon",
                "The Science of Fear: How the Culture of Fear Manipulates Your Brain by Daniel Gardner"
            ]
        },
        {
            "tag": "death",
            "patterns": [
                "My mom died",
                "My brother died",
                "My dad passed away",
                "My sister passed away",
                "Someone in my family died",
                "It's hard to cope with the loss of a loved one who has passed away.",
                "Death is a natural part of life, but it's still difficult to accept.",
                "Losing someone close to you can leave a hole in your heart that never fully heals.",
                "Death can be unexpected and devastating, leaving us feeling helpless and alone.",
                "Grieving the loss of a loved one is a process that takes time and patience.",
                "The pain of losing someone you love never really goes away, but it does get easier to manage with time.",
                "Death is a reminder to cherish the time we have with our loved ones and make the most of every moment.",
                "The loss of a loved one can bring up complex emotions and make it hard to focus on anything else.",
                "Death can be especially hard to process when it happens suddenly or unexpectedly.",
                "It's important to allow yourself to feel your emotions fully when you're dealing with the death of someone close to you.",
                "Even though death is a part of life, it's still a difficult thing to come to terms with.",
                "When someone we love dies, we may feel like we've lost a piece of ourselves as well.",
                "Death can make us question our own mortality and what our purpose in life is.",
                "It's important to remember that grief is a normal and healthy response to the death of a loved one.",
                "The pain of losing someone we care about can be overwhelming, but we will eventually learn to live with it.",
                "Losing someone we love can make us feel powerless and helpless, but there are ways to cope with the pain.",
                "It's okay to lean on others for support when dealing with the death of a loved one.",
                "Even though we may never fully understand why someone had to die, we can find comfort in the memories we shared with them.",
                "The death of a loved one can change us in profound ways, but it doesn't have to define us.",
                "The grief that comes with the death of someone close to us can be a long and difficult journey.",
                "Death can be a reminder to cherish the time we have with our loved ones and make every moment count.",
                "There's no right or wrong way to grieve the loss of a loved one, so it's important to honor your own unique journey.",
                "It's natural to feel overwhelmed and confused when someone close to us dies, but we can find solace in the support of others.",
                "Death can bring up difficult emotions and questions about life and the afterlife.",
                "It's important to take care of yourself and your mental health when dealing with the death of a loved one.",
                "The death of someone close to us can be a transformative experience that helps us grow and find meaning in our lives.",
                "Even though death can be scary and overwhelming, we can find comfort in the memories we shared with our loved ones.",
                "The pain of losing someone we care about can be all-consuming, but eventually we will find a way to move forward.",
                "Death is a reminder to cherish the moments we have with our loved ones and to never take them for granted.",
                "It's okay to seek professional help when dealing with the death of someone close to you.",
                "Allow yourself to grieve and process your emotions at your own pace.",
                "Allow yourself to grieve and process your emotions at your own pace.",
                "Losing someone we love can be a reminder of the fragility of life and how important it is to cherish every moment.",
                "Death is a part of life, but that doesn't make it any easier to accept when someone we love passes away.",
                "The death of a loved one can leave us feeling lost and unsure of how to move forward.",
                "Grief is a journey that is different for everyone, and there is no right or wrong way to go through it.",
                "The death of someone close to us can be a wake-up call to reevaluate our own lives and priorities.",
                "It's important to remember that it's okay to take time to grieve and to honor the memory of our loved ones in our own way.",
                "Losing someone we love can be a traumatic experience that leaves us feeling emotionally drained and overwhelmed.",
                "When someone close to us dies, we may struggle to find meaning in a world that suddenly seems cruel and unfair.",
                "Death can be a difficult and painful experience, but it can also bring us closer to others as we lean on each other for support.",
                "The death of a loved one can trigger feelings of guilt, regret, and unfinished business, which can make the grieving process even more challenging.",
                "It's important to acknowledge and validate our own feelings when dealing with the death of someone close to us, even if they don't always make sense or seem rational.",
                "The pain of losing someone we love can feel all-consuming, but eventually, we will find a way to integrate our loss into our lives and move forward.",
                "When someone close to us dies, it can be difficult to find closure, but the memories we shared with them can help keep their spirit alive in our hearts.",
                "Death can be a reminder to appreciate the simple things in life, like spending time with loved ones and enjoying the present moment.",
                "Losing someone we love can make us question our own beliefs and values, and force us to confront our own mortality.",
                "The death of someone close to us can be a reminder to take care of our own health and well-being, both physically and mentally.",
                "When someone we love dies, we may feel like we've lost a part of ourselves, but over time, we can learn to live with that loss and move forward.",
                "The grief that comes with the death of someone close to us can be isolating, but it's important to reach out for support from friends, family, or a therapist.",
                "Death can be a reminder to live life to the fullest and to make the most of every opportunity.",
                "The death of someone close to us can be a painful and transformative experience that changes us forever.",
                "When someone we love dies, we may feel like we're stuck in a cycle of sadness and despair, but with time and support, we can learn to find joy and meaning in life again.",
                "Death can be a reminder of the impermanence of life and the importance of making the most of every moment we have with our loved ones.",
                "Losing someone we love can make us feel vulnerable and exposed, but it can also open us up to new experiences and opportunities for growth.",
                "The death of a loved one can bring up unresolved issues and conflicts, but it's never too late to work on healing and forgiveness.",
                "When someone we love dies, it can be easy to get caught up in regrets and what-ifs, but it's important to focus on the positive memories and experiences we shared with them.",
                "Death can be a painful and scary experience, but it can also teach us important lessons about love, compassion, and the human spirit.",
                "The death of someone close to us can be a reminder to appreciate the beauty and complexity of life, even in the midst of pain and loss.",
                "My friend passed away"
            ],
            "responses": [
                "The Year of Magical Thinking by Joan Didion",
                "When Breath Becomes Air by Paul Kalanithi",
                "Being Mortal: Medicine and What Matters in the End by Atul Gawande",
                "The Death of Ivan Ilyich by Leo Tolstoy"
            ]
        },
        {
            "tag": "suicide",
            "patterns": [
                "I want to kill myself",
                "I feel like ending it all.",
                "I feel like the only best option is to just give up and end everything",
                "I've thought about killing myself.",
                "I want to die",
                "I am going to kill myself",
                "I am going to commit suicide",
                "I'm feeling like I don't want to live anymore.",
                "I'm feeling like there's no point in going on.",
                "I'm feeling like everyone would be better off without me.",
                "I'm feeling like I'm a burden to everyone around me.",
                "I'm feeling like there's no hope for the future.",
                "I'm feeling like I'm trapped and can't escape my pain.",
                "I'm feeling like I'm in so much emotional pain that I can't handle it.",
                "I'm feeling like I don't have anything to live for.",
                "I'm feeling like suicide is the only way out.",
                "I'm feeling like I'm so overwhelmed that I can't go on.",
                "I'm feeling really hopeless and helpless, like there's no way out of my situation.",
                "I'm experiencing a lot of emotional pain and suffering and it feels unbearable.",
                "I'm feeling like a burden to others and like my loved ones would be better off without me.",
                "I'm struggling with intense feelings of worthlessness or shame and it's leading to thoughts of suicide.",
                "I'm feeling really isolated and alone and like there's nobody I can turn to for help.",
                "I'm experiencing a lot of stress and pressure from external sources, like school or work, and it's causing me to feel suicidal.",
                "I'm feeling really trapped and like there's no way out of my current circumstances.",
                "I'm struggling with a mental health condition like depression or anxiety and it's leading to suicidal thoughts.",
                "I'm feeling like I've lost all sense of purpose or meaning in my life.",
                "I'm experiencing a lot of grief and loss and it's leading to suicidal thoughts or feelings.",
                "I'm feeling really overwhelmed and like I can't handle the challenges and stressors in my life anymore.",
                "I'm experiencing a lot of financial stress and it's leading me to consider suicide as a way out.",
                "I'm feeling really hopeless about the future and like there's nothing to look forward to.",
                "I'm struggling with addiction or substance abuse and it's leading to suicidal thoughts or behaviors.",
                "I'm feeling like my life is out of control and like I can't make meaningful changes.",
                "I'm experiencing a lot of conflict or turmoil in my personal relationships and it's causing me to feel suicidal.",
                "I'm feeling really guilty or ashamed about something and it's leading me to consider suicide as a way to escape.",
                "I'm struggling with a chronic or terminal illness and it's causing me to feel hopeless and suicidal.",
                "I'm feeling really isolated and disconnected from others and it's leading me to consider suicide as a way to end my pain.",
                "I'm experiencing a lot of trauma or abuse and it's causing me to feel like suicide is my only option.",
                "I'm feeling like I've exhausted all my options and there's no other way to escape my pain.",
                "I'm experiencing a lot of social or cultural pressures that are causing me to feel suicidal.",
                "I'm feeling like a failure and like I've let myself and others down.",
                "I'm struggling with a history of trauma or abuse and it's leading to suicidal thoughts or behaviors.",
                "I'm feeling like I'm a burden to society or the world in general and that suicide is the best solution.",
                "I'm experiencing a lot of physical pain or discomfort and it's causing me to feel suicidal.",
                "I'm feeling really hopeless about the state of the world and like there's no hope for the future.",
                "I'm feeling like I'm a burden to my family and friends, and I don't want to be a source of pain for them anymore.",
                "I'm feeling like I've lost all hope and there's no way out of my current situation.",
                "I'm experiencing a lot of bullying or harassment and it's causing me to feel suicidal.",
                "I'm feeling like I'm stuck in a cycle of negative thoughts and emotions and I can't break free from it.",
                "I'm struggling with a recent breakup or loss of a relationship and it's causing me to feel suicidal.",
                "I'm feeling like my life has no purpose or meaning, and there's no reason for me to keep going.",
                "I'm experiencing a lot of self-hatred and negative self-talk that's leading me to consider suicide.",
                "I'm feeling like I don't have any support or resources to help me through my struggles.",
                "I'm struggling with chronic pain or illness and it's causing me to feel hopeless and suicidal.",
                "I'm feeling like I don't belong anywhere and that nobody understands me.",
                "I'm experiencing a lot of financial instability or poverty and it's causing me to feel like there's no way out.",
                "I'm feeling like I've hit rock bottom and there's no way to bounce back from it.",
                "I'm struggling with a disability or chronic condition that's making me feel like a burden on others.",
                "I'm feeling like my mental health is deteriorating and there's no way to recover from it.",
                "I'm experiencing a lot of societal pressure to conform to certain expectations, and it's causing me to feel suicidal.",
                "I'm struggling with feelings of rage or anger and it's leading me to consider suicide as a way to cope.",
                "I'm feeling like there's no one who understands me or what I'm going through, and suicide seems like the only way to escape that loneliness.",
                "I'm feeling like my life has no meaning or purpose, and suicide feels like the only way to end that emptiness.",
                "I'm feeling like I'm a burden to my family or loved ones, and suicide seems like the best way to relieve them of that burden.",
                "I'm experiencing a lot of self-hatred and negative self-talk, and it's leading me to consider suicide as a way to escape those thoughts.",
                "I'm feeling like I've made too many mistakes in my life, and suicide seems like the only way to make up for those mistakes.",
                "I'm struggling with intense feelings of hopelessness and despair, and suicide seems like the only way to escape those feelings.",
                "I'm feeling like I'm in a situation that has no solution or way out, and suicide seems like the only way to end that suffering.",
                "I'm experiencing a lot of physical or emotional pain, and suicide seems like the only way to end that pain.",
                "I'm feeling like my life is completely out of my control, and suicide seems like the only way to take back that control.",
                "I'm feeling like I'm constantly failing or disappointing those around me, and suicide seems like the only way to stop that cycle of failure.",
                "I'm struggling with intense feelings of anxiety or panic, and suicide seems like the only way to escape those feelings.",
                "I'm feeling like my life is completely devoid of joy or happiness, and suicide seems like the only way to end that emptiness.",
                "I'm experiencing a lot of guilt or shame about something, and suicide seems like the only way to escape that shame.",
                "I'm feeling like I'm completely alone in the world, and suicide seems like the only way to escape that isolation.",
                "I'm feeling like I'm a burden to society or the world at large, and suicide seems like the only way to relieve that burden.",
                "I'm feeling like I've lost all sense of control over my life and that suicide is the only way to regain that control.",
                "I'm feeling like I'm at the end of my rope and suicide is the only way to escape the pain.",
                "I'm feeling like I'm a burden on my family and friends and that suicide is the best way to relieve them of that burden.",
                "I'm struggling with feelings of hopelessness and despair, and it's causing me to consider suicide as a way out.",
                "I'm feeling like my life has no purpose or meaning, and that suicide is the only way to find peace.",
                "I'm experiencing a lot of shame or guilt, and it's causing me to feel like suicide is the only way to make things right.",
                "I'm feeling like I've hit rock bottom and that suicide is the only way to start over.",
                "I'm struggling with feelings of worthlessness and self-doubt, and it's causing me to consider suicide as a way to escape those feelings.",
                "I'm feeling like I've lost all hope for the future and that suicide is the only way to end the pain.",
                "I'm experiencing a lot of anxiety or fear, and it's causing me to feel like suicide is the only way to escape those feelings.",
                "I'm feeling like I'm trapped in a cycle of depression and despair, and that suicide is the only way to break free.",
                "I'm experiencing a lot of stress or pressure related to my identity or personal beliefs and it's causing me to feel suicidal.",
                "I'm feeling like I can't escape the pain and suicide is the only way to find peace.",
                "I'm struggling with feelings of hopelessness and despair and it's leading me to consider suicide.",
                "I'm feeling like I'm a burden to my family and friends and that suicide would be a relief for everyone.",
                "I'm experiencing a lot of emotional numbness and detachment and it's leading me to consider suicide as a way to feel something again.",
                "I'm feeling like I'm stuck in a cycle of negative thoughts and emotions and suicide is the only way to break free.",
                "I'm struggling with a sense of purposelessness and it's leading me to consider suicide as a way to find meaning.",
                "I'm feeling like I don't belong anywhere and suicide is the only way to escape the feeling of isolation.",
                "I'm experiencing a lot of self-hatred and it's leading me to consider suicide as a way to punish myself.",
                "I'm feeling like I'm not strong enough to deal with my problems and suicide is the only way to avoid further pain.",
                "I'm struggling with feelings of worthlessness and it's leading me to consider suicide as a way to prove my value.",
                "I'm feeling like my life has no value and suicide is the only way to make a difference.",
                "I'm experiencing a lot of guilt and shame and it's leading me to consider suicide as a way to atone for my mistakes.",
                "I'm feeling like I'm stuck in a hopeless situation and suicide is the only way to change my circumstances.",
                "I'm struggling with a lack of support and resources and it's leading me to consider suicide as a way to cope.",
                "I'm feeling like I'm a burden to the healthcare system and that suicide is the best way to relieve that burden.",
                "I'm experiencing a lot of anxiety and it's leading me to consider suicide as a way to escape the feeling of constant fear.",
                "I'm feeling like I'm living in a world that doesn't understand me and suicide is the only way to find understanding.",
                "I'm struggling with a lack of control over my life and it's leading me to consider suicide as a way to take control.",
                "I'm feeling like I'm in a never-ending cycle of pain and suicide is the only way to end it.",
                "I'm experiencing a lot of anger and resentment and it's leading me to consider suicide as a way to get revenge on those who have wronged me.",
                "I'm feeling like my life is meaningless and suicide is the only way to create a legacy.",
                "I'm struggling with a lack of purpose and direction and it's leading me to consider suicide as a way to find clarity.",
                "I'm feeling like I'm a burden to the environment and that suicide is the only way to reduce my impact.",
                "I'm experiencing a lot of pressure to conform to societal norms and it's leading me to consider suicide as a way to escape that pressure.",
                "I'm feeling like I'm stuck in a situation with no way out and suicide is the only way to change that.",
                "I'm struggling with feelings of inadequacy and it's leading me to consider suicide as a way to prove my worth.",
                "I'm feeling like I'm in constant pain and suicide is the only way to find relief.",
                "I feel like my existence is pointless and suicide is the only way to escape it.",
                "I'm feeling like I'm stuck in a cycle of negative thoughts and emotions, and suicide seems like the only way to break free.",
                "I'm experiencing a lot of physical or sexual abuse and it's causing me to feel like suicide is the only way to end the pain.",
                "I'm feeling like my life is a constant struggle and that suicide is the only way to find peace.",
                "I'm struggling with intense feelings of loneliness or emptiness and it's leading me to consider suicide as a way to fill the void.",
                "I'm feeling like I've been abandoned or betrayed by someone I trusted, and suicide seems like the only way to get back at them.",
                "I'm feeling like I'm a burden to my family and friends, and suicide would be the best way to relieve them of that burden.",
                "I'm experiencing a lot of shame or guilt about something I've done, and it's leading me to consider suicide as a way to escape those feelings.",
                "I'm feeling like my life has no purpose or direction, and suicide is the only way to make it stop.",
                "I'm struggling with a loss or major life change, and it's causing me to feel like suicide is the only way to cope.",
                "I'm feeling like I'm constantly failing or making mistakes, and suicide seems like the only way to avoid further disappointment.",
                "I'm experiencing a lot of pressure to conform to societal expectations, and it's causing me to feel like suicide is the only way to escape that pressure.",
                "I'm feeling like my mental or physical health issues are too overwhelming to deal with, and suicide is the only way out.",
                "I'm struggling with intense feelings of jealousy or envy, and it's leading me to consider suicide as a way to escape those feelings.",
                "I'm feeling like I'm trapped in a job or career that I hate, and suicide seems like the only way to escape it.",
                "I'm experiencing a lot of discrimination or prejudice, and it's causing me to feel like suicide is the only way to escape that pain.",
                "I'm feeling like I'm constantly facing rejection or failure, and suicide seems like the only way to avoid further pain.",
                "I'm struggling with intense feelings of anger or resentment, and it's leading me to consider suicide as a way to express those feelings.",
                "I'm feeling like I'm constantly being judged or criticized, and suicide seems like the only way to escape that judgment.",
                "I'm experiencing a lot of financial hardship, and it's causing me to feel like suicide is the only way to escape my debt.",
                "I'm feeling like I'm constantly being taken advantage of or exploited, and suicide seems like the only way to reclaim my power.",
                "I'm struggling with intense feelings of self-doubt or insecurity, and it's leading me to consider suicide as a way to escape those feelings.",
                "I'm feeling like I'm constantly facing obstacles or challenges that I can't overcome, and suicide seems like the only way to avoid further pain and suffering.",
                "I'm experiencing a lot of social isolation or rejection, and it's causing me to feel like suicide is the only way to escape my loneliness.",
                "I'm feeling like I'm constantly being told that my problems aren't real or valid, and suicide seems like the only way to prove them wrong.",
                "I'm feeling like I'm stuck in a cycle of negative thoughts and emotions that I can't break free from, and suicide seems like the only way out.",
                "I'm feeling like I've hit rock bottom and that there's no way to climb back up, so suicide seems like the only option.",
                "I'm struggling with a lot of self-doubt and low self-esteem, and it's leading me to consider suicide as a way to escape those feelings.",
                "I'm feeling like I'm constantly battling with my own mind, and suicide seems like the only way to find peace.",
                "I'm experiencing a lot of pressure to succeed or meet certain expectations, and it's causing me to feel suicidal.",
                "I'm feeling like I'm a burden to my family or friends, and that suicide would be a way to relieve them of that burden.",
                "I'm struggling with a lot of unresolved trauma or emotional pain, and it's leading me to consider suicide as a way to end that pain.",
                "I'm feeling like my life is meaningless or empty, and suicide seems like the only way to escape that feeling.",
                "I'm experiencing a lot of intense loneliness or social isolation, and it's causing me to feel suicidal.",
                "I'm feeling like I've been dealt a bad hand in life, and that suicide is the only way to stop suffering.",
                "I'm struggling with a lot of unresolved anger or resentment, and it's leading me to consider suicide as a way to cope.",
                "I'm feeling like I'm constantly on edge or in a state of anxiety, and that suicide would be a way to find peace and calm.",
                "I'm experiencing a lot of shame or guilt over something I've done, and it's leading me to consider suicide as a way to escape those feelings.",
                "I'm feeling like I've lost all hope for the future, and that suicide is the only way to end my suffering.",
                "I'm struggling with a lot of unresolved grief or loss, and it's leading me to consider suicide as a way to escape that pain.",
                "I'm feeling like I'm not good enough or that I don't deserve to live, and that suicide is the only logical conclusion.",
                "I'm experiencing a lot of physical pain or illness, and it's causing me to feel suicidal.",
                "I'm feeling like I'm trapped in a situation or circumstance that I can't escape from, and that suicide is the only way out.",
                "I'm struggling with a lot of unresolved guilt or regret over something I've done, and it's leading me to consider suicide as a way to escape those feelings.",
                "I'm feeling like I'm in a lot of emotional pain that I can't escape from, and that suicide would be a way to end that suffering.",
                "I'm experiencing a lot of pressure to conform to societal norms or expectations, and it's causing me to feel suicidal.",
                "I'm feeling like I'm a failure or that I've let myself or others down, and that suicide is the only way to make things right.",
                "I'm struggling with a lot of unresolved conflicts or relationship issues, and it's leading me to consider suicide as a way to escape that pain.",
                "I'm feeling like I'm constantly overwhelmed by life's challenges and stressors, and that suicide is the only way to find relief.",
                "I'm experiencing a lot of financial difficulties or instability, and it's causing me to feel suicidal.",
                "I'm feeling like my mental health is deteriorating and suicide seems like the only way to escape the pain.",
                "I'm struggling with a chronic illness or disability and it's causing me to feel hopeless and suicidal.",
                "I'm feeling like I'm a burden to my family and friends and that suicide is the best option for everyone.",
                "I'm experiencing a lot of discrimination or prejudice and it's causing me to feel suicidal.",
                "I'm feeling like I have no support system and that suicide is the only way to end my pain.",
                "I'm struggling with a sense of hopelessness or helplessness and it's leading me to consider suicide as a way out.",
                "I'm feeling like my life is meaningless and that suicide is the only way to find peace.",
                "I'm experiencing a lot of anxiety or panic attacks and it's causing me to feel suicidal.",
                "I'm feeling like I've lost all sense of control over my life and that suicide is the only way to regain it.",
                "I'm struggling with a sense of guilt or shame and it's leading me to consider suicide as a way to atone for my mistakes.",
                "I'm feeling like I'm stuck in a cycle of negative thoughts and emotions and that suicide is the only escape.",
                "I'm experiencing a lot of physical or emotional pain and it's causing me to feel suicidal.",
                "I'm feeling like I have no purpose in life and that suicide is the only way to end the emptiness.",
                "I'm struggling with a lack of self-worth or self-esteem and it's leading me to consider suicide as a way to end the pain.",
                "I'm feeling like I'm trapped in a toxic environment and that suicide is the only way to escape.",
                "I'm experiencing a lot of anger or resentment and it's causing me to feel suicidal.",
                "I'm feeling like I have no control over my own thoughts or emotions and that suicide is the only way to regain control.",
                "I'm struggling with a sense of betrayal or abandonment and it's leading me to consider suicide as a way to punish those who have hurt me.",
                "I'm feeling like I'm alone in the world and that suicide is the only way to end the loneliness.",
                "I'm experiencing a lot of trauma or PTSD and it's causing me to feel suicidal.",
                "I'm feeling like I have no future and that suicide is the only way to end the hopelessness.",
                "I'm struggling with a lack of motivation or energy and it's leading me to consider suicide as a way to escape the exhaustion.",
                "I'm feeling like I have no place in the world and that suicide is the only way to find my place.",
                "I'm experiencing a lot of grief or loss and it's causing me to feel suicidal.",
                "I'm feeling like I'm a failure and that suicide is the only way to escape the shame.",
                "I'm struggling with a sense of worthlessness or insignificance and it's leading me to consider suicide as a way to end the feelings of inadequacy.",
                "I'm feeling like I have no options and that suicide is the only way to end the desperation.",
                "I'm experiencing a lot of stress or pressure from my personal or professional life and it's causing me to feel suicidal.",
                "I'm feeling like I'm out of options and that suicide is the only way to end the suffering.",
                "I feel like I've hit rock bottom and suicide is the only way out.",
                "I'm feeling like I'm a burden on my family and friends, and they would be better off without me.",
                "I'm experiencing a lot of emotional numbness and detachment, and suicide seems like the only way to feel anything.",
                "I'm feeling like I'm trapped in a cycle of negative thoughts and feelings, and suicide is the only escape.",
                "I'm struggling with feelings of worthlessness and self-hatred, and suicide seems like a way to end the pain.",
                "I'm feeling like there's no way to escape the constant pain and suffering I'm experiencing.",
                "I'm feeling like I've lost all hope for the future and that things will never get better.",
                "I'm experiencing a lot of anxiety and fear, and suicide seems like a way to escape those feelings.",
                "I'm feeling like nobody understands me or what I'm going through, and suicide is the only way to end the loneliness.",
                "I'm struggling with intense guilt or regret, and suicide seems like a way to atone for my mistakes.",
                "I'm feeling like I've lost all sense of purpose in my life, and suicide seems like a way to end the emptiness.",
                "I'm experiencing a lot of physical pain or illness, and suicide seems like a way to end the suffering.",
                "I'm feeling like I've been dealt an unfair hand in life and that suicide is the only way to take control.",
                "I'm struggling with feelings of hopelessness and despair, and suicide seems like the only way out.",
                "I'm feeling like I'm completely alone in the world, and suicide seems like the only way to end the isolation.",
                "I'm experiencing a lot of shame or humiliation, and suicide seems like a way to escape those feelings.",
                "I'm feeling like I'm stuck in a situation that I can't escape from, and suicide is the only way out.",
                "I'm struggling with feelings of betrayal or abandonment, and suicide seems like a way to get revenge.",
                "I'm feeling like I'm a failure in every aspect of my life, and suicide seems like a way to end the shame.",
                "I'm experiencing a lot of pressure to succeed or meet expectations, and suicide seems like a way to escape the stress.",
                "I'm feeling like there's no way to escape the constant negative thoughts in my head.",
                "I'm feeling like nobody cares about me or what happens to me, and suicide is the only way to prove them wrong.",
                "I'm struggling with feelings of jealousy or envy, and suicide seems like a way to end the pain of comparison.",
                "I'm feeling like there's no way to change my circumstances, and suicide seems like the only way to end the suffering.",
                "I'm experiencing a lot of anger or resentment, and suicide seems like a way to get revenge on those who have wronged me.",
                "I'm feeling like I'm a burden on society or the world in general, and suicide is the only way to make things right.",
                "I'm struggling with feelings of nostalgia or longing for a time that can never be recaptured, and suicide seems like a way to end the pain of loss.",
                "I'm feeling like there's no way to escape the constant judgment and criticism of others, and suicide seems like the only way out."
            ],
            "responses": [
                "Reasons to Stay Alive by Matt Haig",
                "The Happiness Trap: How to Stop Struggling and Start Living: A Guide to ACT by Russ Harris",
                "The Upward Spiral: Using Neuroscience to Reverse the Course of Depression, One Small Change at a Time by Alex Korb",
                "How to Be Happy (Or at Least Less Sad): A Creative Workbook by Lee Crutchley",
                "You Can Heal Your Life by Louise Hay",
                "Daring Greatly: How the Courage to Be Vulnerable Transforms the Way We Live, Love, Parent, and Lead by Brene Brown",
                "Lost Connections: Uncovering the Real Causes of Depression and the Unexpected Solutions by Johann Hari"
            ]
        }
    ]
}